lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_bf.h
/** \brief  Mask for Ifx_CIF_BBB_ACCEN0_Bits.EN24 */
#define IFX_CIF_BBB_ACCEN0_EN24_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_BBB_ACCEN0_Bits.EN24 */
#define IFX_CIF_BBB_ACCEN0_EN24_OFF (24u)

/** \brief  Length for Ifx_CIF_BBB_ACCEN0_Bits.EN25 */
#define IFX_CIF_BBB_ACCEN0_EN25_LEN (1u)

/** \brief  Mask for Ifx_CIF_BBB_ACCEN0_Bits.EN25 */
#define IFX_CIF_BBB_ACCEN0_EN25_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_BBB_ACCEN0_Bits.EN25 */
#define IFX_CIF_BBB_ACCEN0_EN25_OFF (25u)

/** \brief  Length for Ifx_CIF_BBB_ACCEN0_Bits.EN26 */
#define IFX_CIF_BBB_ACCEN0_EN26_LEN (1u)

/** \brief  Mask for Ifx_CIF_BBB_ACCEN0_Bits.EN26 */
#define IFX_CIF_BBB_ACCEN0_EN26_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_BBB_ACCEN0_Bits.EN26 */
#define IFX_CIF_BBB_ACCEN0_EN26_OFF (26u)

/** \brief  Length for Ifx_CIF_BBB_ACCEN0_Bits.EN27 */
#define IFX_CIF_BBB_ACCEN0_EN27_LEN (1u)

/** \brief  Mask for Ifx_CIF_BBB_ACCEN0_Bits.EN27 */
#define IFX_CIF_BBB_ACCEN0_EN27_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_BBB_ACCEN0_Bits.EN27 */
#define IFX_CIF_BBB_ACCEN0_EN27_OFF (27u)

/** \brief  Length for Ifx_CIF_BBB_ACCEN0_Bits.EN28 */
#define IFX_CIF_BBB_ACCEN0_EN28_LEN (1u)

/** \brief  Mask for Ifx_CIF_BBB_ACCEN0_Bits.EN28 */
#define IFX_CIF_BBB_ACCEN0_EN28_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_BBB_ACCEN0_Bits.EN28 */
#define IFX_CIF_BBB_ACCEN0_EN28_OFF (28u)

/** \brief  Length for Ifx_CIF_BBB_ACCEN0_Bits.EN29 */
#define IFX_CIF_BBB_ACCEN0_EN29_LEN (1u)

/** \brief  Mask for Ifx_CIF_BBB_ACCEN0_Bits.EN29 */
#define IFX_CIF_BBB_ACCEN0_EN29_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_BBB_ACCEN0_Bits.EN29 */
#define IFX_CIF_BBB_ACCEN0_EN29_OFF (29u)

/** \brief  Length for Ifx_CIF_BBB_ACCEN0_Bits.EN2 */
#define IFX_CIF_BBB_ACCEN0_EN2_LEN (1u)

/** \brief  Mask for Ifx_CIF_BBB_ACCEN0_Bits.EN2 */
#define IFX_CIF_BBB_ACCEN0_EN2_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_BBB_ACCEN0_Bits.EN2 */
#define IFX_CIF_BBB_ACCEN0_EN2_OFF (2u)

/** \brief  Length for Ifx_CIF_BBB_ACCEN0_Bits.EN30 */
#define IFX_CIF_BBB_ACCEN0_EN30_LEN (1u)

/** \brief  Mask for Ifx_CIF_BBB_ACCEN0_Bits.EN30 */
#define IFX_CIF_BBB_ACCEN0_EN30_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_BBB_ACCEN0_Bits.EN30 */
#define IFX_CIF_BBB_ACCEN0_EN30_OFF (30u)

/** \brief  Length for Ifx_CIF_BBB_ACCEN0_Bits.EN31 */
#define IFX_CIF_BBB_ACCEN0_EN31_LEN (1u)

/** \brief  Mask for Ifx_CIF_BBB_ACCEN0_Bits.EN31 */
#define IFX_CIF_BBB_ACCEN0_EN31_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_BBB_ACCEN0_Bits.EN31 */
#define IFX_CIF_BBB_ACCEN0_EN31_OFF (31u)

/** \brief  Length for Ifx_CIF_BBB_ACCEN0_Bits.EN3 */
#define IFX_CIF_BBB_ACCEN0_EN3_LEN (1u)

/** \brief  Mask for Ifx_CIF_BBB_ACCEN0_Bits.EN3 */
#define IFX_CIF_BBB_ACCEN0_EN3_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_BBB_ACCEN0_Bits.EN3 */
#define IFX_CIF_BBB_ACCEN0_EN3_OFF (3u)

/** \brief  Length for Ifx_CIF_BBB_ACCEN0_Bits.EN4 */
#define IFX_CIF_BBB_ACCEN0_EN4_LEN (1u)

/** \brief  Mask for Ifx_CIF_BBB_ACCEN0_Bits.EN4 */
#define IFX_CIF_BBB_ACCEN0_EN4_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_BBB_ACCEN0_Bits.EN4 */
#define IFX_CIF_BBB_ACCEN0_EN4_OFF (4u)

/** \brief  Length for Ifx_CIF_BBB_ACCEN0_Bits.EN5 */
#define IFX_CIF_BBB_ACCEN0_EN5_LEN (1u)

/** \brief  Mask for Ifx_CIF_BBB_ACCEN0_Bits.EN5 */
#define IFX_CIF_BBB_ACCEN0_EN5_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_BBB_ACCEN0_Bits.EN5 */
#define IFX_CIF_BBB_ACCEN0_EN5_OFF (5u)

/** \brief  Length for Ifx_CIF_BBB_ACCEN0_Bits.EN6 */
#define IFX_CIF_BBB_ACCEN0_EN6_LEN (1u)

/** \brief  Mask for Ifx_CIF_BBB_ACCEN0_Bits.EN6 */
#define IFX_CIF_BBB_ACCEN0_EN6_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_BBB_ACCEN0_Bits.EN6 */
#define IFX_CIF_BBB_ACCEN0_EN6_OFF (6u)

/** \brief  Length for Ifx_CIF_BBB_ACCEN0_Bits.EN7 */
#define IFX_CIF_BBB_ACCEN0_EN7_LEN (1u)

/** \brief  Mask for Ifx_CIF_BBB_ACCEN0_Bits.EN7 */
#define IFX_CIF_BBB_ACCEN0_EN7_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_BBB_ACCEN0_Bits.EN7 */
#define IFX_CIF_BBB_ACCEN0_EN7_OFF (7u)

/** \brief  Length for Ifx_CIF_BBB_ACCEN0_Bits.EN8 */
#define IFX_CIF_BBB_ACCEN0_EN8_LEN (1u)

/** \brief  Mask for Ifx_CIF_BBB_ACCEN0_Bits.EN8 */
#define IFX_CIF_BBB_ACCEN0_EN8_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_BBB_ACCEN0_Bits.EN8 */
#define IFX_CIF_BBB_ACCEN0_EN8_OFF (8u)

/** \brief  Length for Ifx_CIF_BBB_ACCEN0_Bits.EN9 */
#define IFX_CIF_BBB_ACCEN0_EN9_LEN (1u)

/** \brief  Mask for Ifx_CIF_BBB_ACCEN0_Bits.EN9 */
#define IFX_CIF_BBB_ACCEN0_EN9_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_BBB_ACCEN0_Bits.EN9 */
#define IFX_CIF_BBB_ACCEN0_EN9_OFF (9u)

/** \brief  Length for Ifx_CIF_BBB_CLC_Bits.DISR */
#define IFX_CIF_BBB_CLC_DISR_LEN (1u)

/** \brief  Mask for Ifx_CIF_BBB_CLC_Bits.DISR */
#define IFX_CIF_BBB_CLC_DISR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_BBB_CLC_Bits.DISR */
#define IFX_CIF_BBB_CLC_DISR_OFF (0u)

/** \brief  Length for Ifx_CIF_BBB_CLC_Bits.DISS */
#define IFX_CIF_BBB_CLC_DISS_LEN (1u)

/** \brief  Mask for Ifx_CIF_BBB_CLC_Bits.DISS */
#define IFX_CIF_BBB_CLC_DISS_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_BBB_CLC_Bits.DISS */
#define IFX_CIF_BBB_CLC_DISS_OFF (1u)

/** \brief  Length for Ifx_CIF_BBB_GPCTL_Bits.PISEL */
#define IFX_CIF_BBB_GPCTL_PISEL_LEN (1u)

/** \brief  Mask for Ifx_CIF_BBB_GPCTL_Bits.PISEL */
#define IFX_CIF_BBB_GPCTL_PISEL_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_BBB_GPCTL_Bits.PISEL */
#define IFX_CIF_BBB_GPCTL_PISEL_OFF (0u)

/** \brief  Length for Ifx_CIF_BBB_KRST0_Bits.RST */
#define IFX_CIF_BBB_KRST0_RST_LEN (1u)

/** \brief  Mask for Ifx_CIF_BBB_KRST0_Bits.RST */
#define IFX_CIF_BBB_KRST0_RST_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_BBB_KRST0_Bits.RST */
#define IFX_CIF_BBB_KRST0_RST_OFF (0u)

/** \brief  Length for Ifx_CIF_BBB_KRST0_Bits.RSTSTAT */
#define IFX_CIF_BBB_KRST0_RSTSTAT_LEN (1u)

/** \brief  Mask for Ifx_CIF_BBB_KRST0_Bits.RSTSTAT */
#define IFX_CIF_BBB_KRST0_RSTSTAT_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_BBB_KRST0_Bits.RSTSTAT */
#define IFX_CIF_BBB_KRST0_RSTSTAT_OFF (1u)

/** \brief  Length for Ifx_CIF_BBB_KRST1_Bits.RST */
#define IFX_CIF_BBB_KRST1_RST_LEN (1u)

