lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_bf.h
/** \brief  Mask for Ifx_CIF_BBB_KRST1_Bits.RST */
#define IFX_CIF_BBB_KRST1_RST_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_BBB_KRST1_Bits.RST */
#define IFX_CIF_BBB_KRST1_RST_OFF (0u)

/** \brief  Length for Ifx_CIF_BBB_KRSTCLR_Bits.CLR */
#define IFX_CIF_BBB_KRSTCLR_CLR_LEN (1u)

/** \brief  Mask for Ifx_CIF_BBB_KRSTCLR_Bits.CLR */
#define IFX_CIF_BBB_KRSTCLR_CLR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_BBB_KRSTCLR_Bits.CLR */
#define IFX_CIF_BBB_KRSTCLR_CLR_OFF (0u)

/** \brief  Length for Ifx_CIF_BBB_MODID_Bits.MOD_REV */
#define IFX_CIF_BBB_MODID_MOD_REV_LEN (8u)

/** \brief  Mask for Ifx_CIF_BBB_MODID_Bits.MOD_REV */
#define IFX_CIF_BBB_MODID_MOD_REV_MSK (0xffu)

/** \brief  Offset for Ifx_CIF_BBB_MODID_Bits.MOD_REV */
#define IFX_CIF_BBB_MODID_MOD_REV_OFF (0u)

/** \brief  Length for Ifx_CIF_BBB_MODID_Bits.MOD_TYPE */
#define IFX_CIF_BBB_MODID_MOD_TYPE_LEN (8u)

/** \brief  Mask for Ifx_CIF_BBB_MODID_Bits.MOD_TYPE */
#define IFX_CIF_BBB_MODID_MOD_TYPE_MSK (0xffu)

/** \brief  Offset for Ifx_CIF_BBB_MODID_Bits.MOD_TYPE */
#define IFX_CIF_BBB_MODID_MOD_TYPE_OFF (8u)

/** \brief  Length for Ifx_CIF_BBB_MODID_Bits.MODNUMBER */
#define IFX_CIF_BBB_MODID_MODNUMBER_LEN (16u)

/** \brief  Mask for Ifx_CIF_BBB_MODID_Bits.MODNUMBER */
#define IFX_CIF_BBB_MODID_MODNUMBER_MSK (0xffffu)

/** \brief  Offset for Ifx_CIF_BBB_MODID_Bits.MODNUMBER */
#define IFX_CIF_BBB_MODID_MODNUMBER_OFF (16u)

/** \brief  Length for Ifx_CIF_CCL_Bits.CIF_CCLDISS */
#define IFX_CIF_CCL_CIF_CCLDISS_LEN (1u)

/** \brief  Mask for Ifx_CIF_CCL_Bits.CIF_CCLDISS */
#define IFX_CIF_CCL_CIF_CCLDISS_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_CCL_Bits.CIF_CCLDISS */
#define IFX_CIF_CCL_CIF_CCLDISS_OFF (1u)

/** \brief  Length for Ifx_CIF_CCL_Bits.CIF_CCLFDIS */
#define IFX_CIF_CCL_CIF_CCLFDIS_LEN (1u)

/** \brief  Mask for Ifx_CIF_CCL_Bits.CIF_CCLFDIS */
#define IFX_CIF_CCL_CIF_CCLFDIS_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_CCL_Bits.CIF_CCLFDIS */
#define IFX_CIF_CCL_CIF_CCLFDIS_OFF (2u)

/** \brief  Length for Ifx_CIF_DP_CTRL_Bits.DP_EN */
#define IFX_CIF_DP_CTRL_DP_EN_LEN (1u)

/** \brief  Mask for Ifx_CIF_DP_CTRL_Bits.DP_EN */
#define IFX_CIF_DP_CTRL_DP_EN_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_DP_CTRL_Bits.DP_EN */
#define IFX_CIF_DP_CTRL_DP_EN_OFF (0u)

/** \brief  Length for Ifx_CIF_DP_CTRL_Bits.DP_SEL */
#define IFX_CIF_DP_CTRL_DP_SEL_LEN (3u)

/** \brief  Mask for Ifx_CIF_DP_CTRL_Bits.DP_SEL */
#define IFX_CIF_DP_CTRL_DP_SEL_MSK (0x7u)

/** \brief  Offset for Ifx_CIF_DP_CTRL_Bits.DP_SEL */
#define IFX_CIF_DP_CTRL_DP_SEL_OFF (1u)

/** \brief  Length for Ifx_CIF_DP_CTRL_Bits.FNC_EN */
#define IFX_CIF_DP_CTRL_FNC_EN_LEN (1u)

/** \brief  Mask for Ifx_CIF_DP_CTRL_Bits.FNC_EN */
#define IFX_CIF_DP_CTRL_FNC_EN_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_DP_CTRL_Bits.FNC_EN */
#define IFX_CIF_DP_CTRL_FNC_EN_OFF (13u)

/** \brief  Length for Ifx_CIF_DP_CTRL_Bits.LNC_EN */
#define IFX_CIF_DP_CTRL_LNC_EN_LEN (1u)

/** \brief  Mask for Ifx_CIF_DP_CTRL_Bits.LNC_EN */
#define IFX_CIF_DP_CTRL_LNC_EN_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_DP_CTRL_Bits.LNC_EN */
#define IFX_CIF_DP_CTRL_LNC_EN_OFF (14u)

/** \brief  Length for Ifx_CIF_DP_CTRL_Bits.RST_FNC */
#define IFX_CIF_DP_CTRL_RST_FNC_LEN (1u)

/** \brief  Mask for Ifx_CIF_DP_CTRL_Bits.RST_FNC */
#define IFX_CIF_DP_CTRL_RST_FNC_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_DP_CTRL_Bits.RST_FNC */
#define IFX_CIF_DP_CTRL_RST_FNC_OFF (8u)

/** \brief  Length for Ifx_CIF_DP_CTRL_Bits.RST_LNC */
#define IFX_CIF_DP_CTRL_RST_LNC_LEN (1u)

/** \brief  Mask for Ifx_CIF_DP_CTRL_Bits.RST_LNC */
#define IFX_CIF_DP_CTRL_RST_LNC_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_DP_CTRL_Bits.RST_LNC */
#define IFX_CIF_DP_CTRL_RST_LNC_OFF (9u)

/** \brief  Length for Ifx_CIF_DP_CTRL_Bits.RST_PD */
#define IFX_CIF_DP_CTRL_RST_PD_LEN (1u)

/** \brief  Mask for Ifx_CIF_DP_CTRL_Bits.RST_PD */
#define IFX_CIF_DP_CTRL_RST_PD_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_DP_CTRL_Bits.RST_PD */
#define IFX_CIF_DP_CTRL_RST_PD_OFF (11u)

/** \brief  Length for Ifx_CIF_DP_CTRL_Bits.RST_TSC */
#define IFX_CIF_DP_CTRL_RST_TSC_LEN (1u)

/** \brief  Mask for Ifx_CIF_DP_CTRL_Bits.RST_TSC */
#define IFX_CIF_DP_CTRL_RST_TSC_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_DP_CTRL_Bits.RST_TSC */
#define IFX_CIF_DP_CTRL_RST_TSC_OFF (10u)

/** \brief  Length for Ifx_CIF_DP_CTRL_Bits.TSC_EN */
#define IFX_CIF_DP_CTRL_TSC_EN_LEN (1u)

/** \brief  Mask for Ifx_CIF_DP_CTRL_Bits.TSC_EN */
#define IFX_CIF_DP_CTRL_TSC_EN_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_DP_CTRL_Bits.TSC_EN */
#define IFX_CIF_DP_CTRL_TSC_EN_OFF (15u)

/** \brief  Length for Ifx_CIF_DP_CTRL_Bits.UDS1 */
#define IFX_CIF_DP_CTRL_UDS1_LEN (1u)

/** \brief  Mask for Ifx_CIF_DP_CTRL_Bits.UDS1 */
#define IFX_CIF_DP_CTRL_UDS1_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_DP_CTRL_Bits.UDS1 */
#define IFX_CIF_DP_CTRL_UDS1_OFF (16u)

/** \brief  Length for Ifx_CIF_DP_CTRL_Bits.UDS2 */
#define IFX_CIF_DP_CTRL_UDS2_LEN (1u)

/** \brief  Mask for Ifx_CIF_DP_CTRL_Bits.UDS2 */
#define IFX_CIF_DP_CTRL_UDS2_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_DP_CTRL_Bits.UDS2 */
#define IFX_CIF_DP_CTRL_UDS2_OFF (17u)

/** \brief  Length for Ifx_CIF_DP_CTRL_Bits.UDS3 */
#define IFX_CIF_DP_CTRL_UDS3_LEN (1u)

/** \brief  Mask for Ifx_CIF_DP_CTRL_Bits.UDS3 */
#define IFX_CIF_DP_CTRL_UDS3_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_DP_CTRL_Bits.UDS3 */
#define IFX_CIF_DP_CTRL_UDS3_OFF (18u)

/** \brief  Length for Ifx_CIF_DP_CTRL_Bits.UDS4 */
#define IFX_CIF_DP_CTRL_UDS4_LEN (1u)

/** \brief  Mask for Ifx_CIF_DP_CTRL_Bits.UDS4 */
#define IFX_CIF_DP_CTRL_UDS4_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_DP_CTRL_Bits.UDS4 */
#define IFX_CIF_DP_CTRL_UDS4_OFF (19u)

/** \brief  Length for Ifx_CIF_DP_CTRL_Bits.UDS5 */
#define IFX_CIF_DP_CTRL_UDS5_LEN (1u)

/** \brief  Mask for Ifx_CIF_DP_CTRL_Bits.UDS5 */
#define IFX_CIF_DP_CTRL_UDS5_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_DP_CTRL_Bits.UDS5 */
#define IFX_CIF_DP_CTRL_UDS5_OFF (20u)

/** \brief  Length for Ifx_CIF_DP_CTRL_Bits.UDS6 */
#define IFX_CIF_DP_CTRL_UDS6_LEN (1u)

/** \brief  Mask for Ifx_CIF_DP_CTRL_Bits.UDS6 */
#define IFX_CIF_DP_CTRL_UDS6_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_DP_CTRL_Bits.UDS6 */
#define IFX_CIF_DP_CTRL_UDS6_OFF (21u)

/** \brief  Length for Ifx_CIF_DP_CTRL_Bits.UDS7 */
#define IFX_CIF_DP_CTRL_UDS7_LEN (1u)

/** \brief  Mask for Ifx_CIF_DP_CTRL_Bits.UDS7 */
#define IFX_CIF_DP_CTRL_UDS7_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_DP_CTRL_Bits.UDS7 */
#define IFX_CIF_DP_CTRL_UDS7_OFF (22u)

