lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_bf.h
/** \brief  Length for Ifx_CIF_DP_CTRL_Bits.UDS8 */
#define IFX_CIF_DP_CTRL_UDS8_LEN (1u)

/** \brief  Mask for Ifx_CIF_DP_CTRL_Bits.UDS8 */
#define IFX_CIF_DP_CTRL_UDS8_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_DP_CTRL_Bits.UDS8 */
#define IFX_CIF_DP_CTRL_UDS8_OFF (23u)

/** \brief  Length for Ifx_CIF_DP_FLC_STAT_Bits.FNC_VAL */
#define IFX_CIF_DP_FLC_STAT_FNC_VAL_LEN (15u)

/** \brief  Mask for Ifx_CIF_DP_FLC_STAT_Bits.FNC_VAL */
#define IFX_CIF_DP_FLC_STAT_FNC_VAL_MSK (0x7fffu)

/** \brief  Offset for Ifx_CIF_DP_FLC_STAT_Bits.FNC_VAL */
#define IFX_CIF_DP_FLC_STAT_FNC_VAL_OFF (0u)

/** \brief  Length for Ifx_CIF_DP_FLC_STAT_Bits.LNC_VAL */
#define IFX_CIF_DP_FLC_STAT_LNC_VAL_LEN (15u)

/** \brief  Mask for Ifx_CIF_DP_FLC_STAT_Bits.LNC_VAL */
#define IFX_CIF_DP_FLC_STAT_LNC_VAL_MSK (0x7fffu)

/** \brief  Offset for Ifx_CIF_DP_FLC_STAT_Bits.LNC_VAL */
#define IFX_CIF_DP_FLC_STAT_LNC_VAL_OFF (16u)

/** \brief  Length for Ifx_CIF_DP_PDIV_CTRL_Bits.PDIV_VAL */
#define IFX_CIF_DP_PDIV_CTRL_PDIV_VAL_LEN (32u)

/** \brief  Mask for Ifx_CIF_DP_PDIV_CTRL_Bits.PDIV_VAL */
#define IFX_CIF_DP_PDIV_CTRL_PDIV_VAL_MSK (0xffffffffu)

/** \brief  Offset for Ifx_CIF_DP_PDIV_CTRL_Bits.PDIV_VAL */
#define IFX_CIF_DP_PDIV_CTRL_PDIV_VAL_OFF (0u)

/** \brief  Length for Ifx_CIF_DP_PDIV_STAT_Bits.PDIV_VAL */
#define IFX_CIF_DP_PDIV_STAT_PDIV_VAL_LEN (32u)

/** \brief  Mask for Ifx_CIF_DP_PDIV_STAT_Bits.PDIV_VAL */
#define IFX_CIF_DP_PDIV_STAT_PDIV_VAL_MSK (0xffffffffu)

/** \brief  Offset for Ifx_CIF_DP_PDIV_STAT_Bits.PDIV_VAL */
#define IFX_CIF_DP_PDIV_STAT_PDIV_VAL_OFF (0u)

/** \brief  Length for Ifx_CIF_DP_TSC_STAT_Bits.TSC_VAL */
#define IFX_CIF_DP_TSC_STAT_TSC_VAL_LEN (30u)

/** \brief  Mask for Ifx_CIF_DP_TSC_STAT_Bits.TSC_VAL */
#define IFX_CIF_DP_TSC_STAT_TSC_VAL_MSK (0x3fffffffu)

/** \brief  Offset for Ifx_CIF_DP_TSC_STAT_Bits.TSC_VAL */
#define IFX_CIF_DP_TSC_STAT_TSC_VAL_OFF (0u)

/** \brief  Length for Ifx_CIF_DP_UDS_Bits.UDS */
#define IFX_CIF_DP_UDS_UDS_LEN (15u)

/** \brief  Mask for Ifx_CIF_DP_UDS_Bits.UDS */
#define IFX_CIF_DP_UDS_UDS_MSK (0x7fffu)

/** \brief  Offset for Ifx_CIF_DP_UDS_Bits.UDS */
#define IFX_CIF_DP_UDS_UDS_OFF (0u)

/** \brief  Length for Ifx_CIF_DPCL_Bits.CIF_CHAN_MODE */
#define IFX_CIF_DPCL_CIF_CHAN_MODE_LEN (2u)

/** \brief  Mask for Ifx_CIF_DPCL_Bits.CIF_CHAN_MODE */
#define IFX_CIF_DPCL_CIF_CHAN_MODE_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_DPCL_Bits.CIF_CHAN_MODE */
#define IFX_CIF_DPCL_CIF_CHAN_MODE_OFF (2u)

/** \brief  Length for Ifx_CIF_DPCL_Bits.CIF_MP_MUX */
#define IFX_CIF_DPCL_CIF_MP_MUX_LEN (2u)

/** \brief  Mask for Ifx_CIF_DPCL_Bits.CIF_MP_MUX */
#define IFX_CIF_DPCL_CIF_MP_MUX_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_DPCL_Bits.CIF_MP_MUX */
#define IFX_CIF_DPCL_CIF_MP_MUX_OFF (0u)

/** \brief  Length for Ifx_CIF_DPCL_Bits.IF_SELECT */
#define IFX_CIF_DPCL_IF_SELECT_LEN (2u)

/** \brief  Mask for Ifx_CIF_DPCL_Bits.IF_SELECT */
#define IFX_CIF_DPCL_IF_SELECT_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_DPCL_Bits.IF_SELECT */
#define IFX_CIF_DPCL_IF_SELECT_OFF (8u)

/** \brief  Length for Ifx_CIF_EP_IC_CTRL_Bits.IC_EN */
#define IFX_CIF_EP_IC_CTRL_IC_EN_LEN (1u)

/** \brief  Mask for Ifx_CIF_EP_IC_CTRL_Bits.IC_EN */
#define IFX_CIF_EP_IC_CTRL_IC_EN_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_EP_IC_CTRL_Bits.IC_EN */
#define IFX_CIF_EP_IC_CTRL_IC_EN_OFF (0u)

/** \brief  Length for Ifx_CIF_EP_IC_DISPLACE_Bits.DX */
#define IFX_CIF_EP_IC_DISPLACE_DX_LEN (12u)

/** \brief  Mask for Ifx_CIF_EP_IC_DISPLACE_Bits.DX */
#define IFX_CIF_EP_IC_DISPLACE_DX_MSK (0xfffu)

/** \brief  Offset for Ifx_CIF_EP_IC_DISPLACE_Bits.DX */
#define IFX_CIF_EP_IC_DISPLACE_DX_OFF (0u)

/** \brief  Length for Ifx_CIF_EP_IC_DISPLACE_Bits.DY */
#define IFX_CIF_EP_IC_DISPLACE_DY_LEN (12u)

/** \brief  Mask for Ifx_CIF_EP_IC_DISPLACE_Bits.DY */
#define IFX_CIF_EP_IC_DISPLACE_DY_MSK (0xfffu)

/** \brief  Offset for Ifx_CIF_EP_IC_DISPLACE_Bits.DY */
#define IFX_CIF_EP_IC_DISPLACE_DY_OFF (16u)

/** \brief  Length for Ifx_CIF_EP_IC_H_OFFS_Bits.H_OFFS */
#define IFX_CIF_EP_IC_H_OFFS_H_OFFS_LEN (12u)

/** \brief  Mask for Ifx_CIF_EP_IC_H_OFFS_Bits.H_OFFS */
#define IFX_CIF_EP_IC_H_OFFS_H_OFFS_MSK (0xfffu)

/** \brief  Offset for Ifx_CIF_EP_IC_H_OFFS_Bits.H_OFFS */
#define IFX_CIF_EP_IC_H_OFFS_H_OFFS_OFF (0u)

/** \brief  Length for Ifx_CIF_EP_IC_H_OFFS_SHD_Bits.H_OFFS_SHD */
#define IFX_CIF_EP_IC_H_OFFS_SHD_H_OFFS_SHD_LEN (13u)

/** \brief  Mask for Ifx_CIF_EP_IC_H_OFFS_SHD_Bits.H_OFFS_SHD */
#define IFX_CIF_EP_IC_H_OFFS_SHD_H_OFFS_SHD_MSK (0x1fffu)

/** \brief  Offset for Ifx_CIF_EP_IC_H_OFFS_SHD_Bits.H_OFFS_SHD */
#define IFX_CIF_EP_IC_H_OFFS_SHD_H_OFFS_SHD_OFF (0u)

/** \brief  Length for Ifx_CIF_EP_IC_H_SIZE_Bits.H_SIZE */
#define IFX_CIF_EP_IC_H_SIZE_H_SIZE_LEN (12u)

/** \brief  Mask for Ifx_CIF_EP_IC_H_SIZE_Bits.H_SIZE */
#define IFX_CIF_EP_IC_H_SIZE_H_SIZE_MSK (0xfffu)

/** \brief  Offset for Ifx_CIF_EP_IC_H_SIZE_Bits.H_SIZE */
#define IFX_CIF_EP_IC_H_SIZE_H_SIZE_OFF (0u)

/** \brief  Length for Ifx_CIF_EP_IC_H_SIZE_SHD_Bits.H_SIZE_SHD */
#define IFX_CIF_EP_IC_H_SIZE_SHD_H_SIZE_SHD_LEN (13u)

/** \brief  Mask for Ifx_CIF_EP_IC_H_SIZE_SHD_Bits.H_SIZE_SHD */
#define IFX_CIF_EP_IC_H_SIZE_SHD_H_SIZE_SHD_MSK (0x1fffu)

/** \brief  Offset for Ifx_CIF_EP_IC_H_SIZE_SHD_Bits.H_SIZE_SHD */
#define IFX_CIF_EP_IC_H_SIZE_SHD_H_SIZE_SHD_OFF (0u)

/** \brief  Length for Ifx_CIF_EP_IC_MAX_DX_Bits.MAX_DX */
#define IFX_CIF_EP_IC_MAX_DX_MAX_DX_LEN (12u)

/** \brief  Mask for Ifx_CIF_EP_IC_MAX_DX_Bits.MAX_DX */
#define IFX_CIF_EP_IC_MAX_DX_MAX_DX_MSK (0xfffu)

/** \brief  Offset for Ifx_CIF_EP_IC_MAX_DX_Bits.MAX_DX */
#define IFX_CIF_EP_IC_MAX_DX_MAX_DX_OFF (0u)

/** \brief  Length for Ifx_CIF_EP_IC_MAX_DY_Bits.MAX_DY */
#define IFX_CIF_EP_IC_MAX_DY_MAX_DY_LEN (12u)

/** \brief  Mask for Ifx_CIF_EP_IC_MAX_DY_Bits.MAX_DY */
#define IFX_CIF_EP_IC_MAX_DY_MAX_DY_MSK (0xfffu)

/** \brief  Offset for Ifx_CIF_EP_IC_MAX_DY_Bits.MAX_DY */
#define IFX_CIF_EP_IC_MAX_DY_MAX_DY_OFF (0u)

/** \brief  Length for Ifx_CIF_EP_IC_RECENTER_Bits.RECENTER */
#define IFX_CIF_EP_IC_RECENTER_RECENTER_LEN (3u)

