lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_bf.h
/** \brief  Mask for Ifx_CIF_EP_IC_RECENTER_Bits.RECENTER */
#define IFX_CIF_EP_IC_RECENTER_RECENTER_MSK (0x7u)

/** \brief  Offset for Ifx_CIF_EP_IC_RECENTER_Bits.RECENTER */
#define IFX_CIF_EP_IC_RECENTER_RECENTER_OFF (0u)

/** \brief  Length for Ifx_CIF_EP_IC_V_OFFS_SHD_Bits.V_OFFS_SHD */
#define IFX_CIF_EP_IC_V_OFFS_SHD_V_OFFS_SHD_LEN (12u)

/** \brief  Mask for Ifx_CIF_EP_IC_V_OFFS_SHD_Bits.V_OFFS_SHD */
#define IFX_CIF_EP_IC_V_OFFS_SHD_V_OFFS_SHD_MSK (0xfffu)

/** \brief  Offset for Ifx_CIF_EP_IC_V_OFFS_SHD_Bits.V_OFFS_SHD */
#define IFX_CIF_EP_IC_V_OFFS_SHD_V_OFFS_SHD_OFF (0u)

/** \brief  Length for Ifx_CIF_EP_IC_V_OFFS_Bits.V_OFFS */
#define IFX_CIF_EP_IC_V_OFFS_V_OFFS_LEN (12u)

/** \brief  Mask for Ifx_CIF_EP_IC_V_OFFS_Bits.V_OFFS */
#define IFX_CIF_EP_IC_V_OFFS_V_OFFS_MSK (0xfffu)

/** \brief  Offset for Ifx_CIF_EP_IC_V_OFFS_Bits.V_OFFS */
#define IFX_CIF_EP_IC_V_OFFS_V_OFFS_OFF (0u)

/** \brief  Length for Ifx_CIF_EP_IC_V_SIZE_SHD_Bits.V_SIZE_SHD */
#define IFX_CIF_EP_IC_V_SIZE_SHD_V_SIZE_SHD_LEN (12u)

/** \brief  Mask for Ifx_CIF_EP_IC_V_SIZE_SHD_Bits.V_SIZE_SHD */
#define IFX_CIF_EP_IC_V_SIZE_SHD_V_SIZE_SHD_MSK (0xfffu)

/** \brief  Offset for Ifx_CIF_EP_IC_V_SIZE_SHD_Bits.V_SIZE_SHD */
#define IFX_CIF_EP_IC_V_SIZE_SHD_V_SIZE_SHD_OFF (0u)

/** \brief  Length for Ifx_CIF_EP_IC_V_SIZE_Bits.V_SIZE */
#define IFX_CIF_EP_IC_V_SIZE_V_SIZE_LEN (12u)

/** \brief  Mask for Ifx_CIF_EP_IC_V_SIZE_Bits.V_SIZE */
#define IFX_CIF_EP_IC_V_SIZE_V_SIZE_MSK (0xfffu)

/** \brief  Offset for Ifx_CIF_EP_IC_V_SIZE_Bits.V_SIZE */
#define IFX_CIF_EP_IC_V_SIZE_V_SIZE_OFF (0u)

/** \brief  Length for Ifx_CIF_ICCL_Bits.CIF_DEBUG_PATH_CLK_EN */
#define IFX_CIF_ICCL_CIF_DEBUG_PATH_CLK_EN_LEN (1u)

/** \brief  Mask for Ifx_CIF_ICCL_Bits.CIF_DEBUG_PATH_CLK_EN */
#define IFX_CIF_ICCL_CIF_DEBUG_PATH_CLK_EN_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ICCL_Bits.CIF_DEBUG_PATH_CLK_EN */
#define IFX_CIF_ICCL_CIF_DEBUG_PATH_CLK_EN_OFF (19u)

/** \brief  Length for Ifx_CIF_ICCL_Bits.CIF_EXTRA_PATHS_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_EXTRA_PATHS_CLK_ENABLE_LEN (1u)

/** \brief  Mask for Ifx_CIF_ICCL_Bits.CIF_EXTRA_PATHS_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_EXTRA_PATHS_CLK_ENABLE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ICCL_Bits.CIF_EXTRA_PATHS_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_EXTRA_PATHS_CLK_ENABLE_OFF (18u)

/** \brief  Length for Ifx_CIF_ICCL_Bits.CIF_ISP_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_ISP_CLK_ENABLE_LEN (1u)

/** \brief  Mask for Ifx_CIF_ICCL_Bits.CIF_ISP_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_ISP_CLK_ENABLE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ICCL_Bits.CIF_ISP_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_ISP_CLK_ENABLE_OFF (0u)

/** \brief  Length for Ifx_CIF_ICCL_Bits.CIF_JPEG_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_JPEG_CLK_ENABLE_LEN (1u)

/** \brief  Mask for Ifx_CIF_ICCL_Bits.CIF_JPEG_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_JPEG_CLK_ENABLE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ICCL_Bits.CIF_JPEG_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_JPEG_CLK_ENABLE_OFF (5u)

/** \brief  Length for Ifx_CIF_ICCL_Bits.CIF_LIN_DSCALER_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_LIN_DSCALER_CLK_ENABLE_LEN (1u)

/** \brief  Mask for Ifx_CIF_ICCL_Bits.CIF_LIN_DSCALER_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_LIN_DSCALER_CLK_ENABLE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ICCL_Bits.CIF_LIN_DSCALER_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_LIN_DSCALER_CLK_ENABLE_OFF (17u)

/** \brief  Length for Ifx_CIF_ICCL_Bits.CIF_MI_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_MI_CLK_ENABLE_LEN (1u)

/** \brief  Mask for Ifx_CIF_ICCL_Bits.CIF_MI_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_MI_CLK_ENABLE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ICCL_Bits.CIF_MI_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_MI_CLK_ENABLE_OFF (6u)

/** \brief  Length for Ifx_CIF_ICCL_Bits.CIF_WATCHDOG_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_WATCHDOG_CLK_ENABLE_LEN (1u)

/** \brief  Mask for Ifx_CIF_ICCL_Bits.CIF_WATCHDOG_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_WATCHDOG_CLK_ENABLE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ICCL_Bits.CIF_WATCHDOG_CLK_ENABLE */
#define IFX_CIF_ICCL_CIF_WATCHDOG_CLK_ENABLE_OFF (16u)

/** \brief  Length for Ifx_CIF_ID_Bits.MODNUMBER */
#define IFX_CIF_ID_MODNUMBER_LEN (16u)

/** \brief  Mask for Ifx_CIF_ID_Bits.MODNUMBER */
#define IFX_CIF_ID_MODNUMBER_MSK (0xffffu)

/** \brief  Offset for Ifx_CIF_ID_Bits.MODNUMBER */
#define IFX_CIF_ID_MODNUMBER_OFF (16u)

/** \brief  Length for Ifx_CIF_ID_Bits.MODREV */
#define IFX_CIF_ID_MODREV_LEN (8u)

/** \brief  Mask for Ifx_CIF_ID_Bits.MODREV */
#define IFX_CIF_ID_MODREV_MSK (0xffu)

/** \brief  Offset for Ifx_CIF_ID_Bits.MODREV */
#define IFX_CIF_ID_MODREV_OFF (0u)

/** \brief  Length for Ifx_CIF_ID_Bits.MODTYPE */
#define IFX_CIF_ID_MODTYPE_LEN (8u)

/** \brief  Mask for Ifx_CIF_ID_Bits.MODTYPE */
#define IFX_CIF_ID_MODTYPE_MSK (0xffu)

/** \brief  Offset for Ifx_CIF_ID_Bits.MODTYPE */
#define IFX_CIF_ID_MODTYPE_OFF (8u)

/** \brief  Length for Ifx_CIF_IRCL_Bits.CIF_DEBUG_PATH_RST */
#define IFX_CIF_IRCL_CIF_DEBUG_PATH_RST_LEN (1u)

/** \brief  Mask for Ifx_CIF_IRCL_Bits.CIF_DEBUG_PATH_RST */
#define IFX_CIF_IRCL_CIF_DEBUG_PATH_RST_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_IRCL_Bits.CIF_DEBUG_PATH_RST */
#define IFX_CIF_IRCL_CIF_DEBUG_PATH_RST_OFF (19u)

/** \brief  Length for Ifx_CIF_IRCL_Bits.CIF_EXTRA_PATHS_RST */
#define IFX_CIF_IRCL_CIF_EXTRA_PATHS_RST_LEN (1u)

/** \brief  Mask for Ifx_CIF_IRCL_Bits.CIF_EXTRA_PATHS_RST */
#define IFX_CIF_IRCL_CIF_EXTRA_PATHS_RST_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_IRCL_Bits.CIF_EXTRA_PATHS_RST */
#define IFX_CIF_IRCL_CIF_EXTRA_PATHS_RST_OFF (18u)

/** \brief  Length for Ifx_CIF_IRCL_Bits.CIF_GLOBAL_RST */
#define IFX_CIF_IRCL_CIF_GLOBAL_RST_LEN (1u)

/** \brief  Mask for Ifx_CIF_IRCL_Bits.CIF_GLOBAL_RST */
#define IFX_CIF_IRCL_CIF_GLOBAL_RST_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_IRCL_Bits.CIF_GLOBAL_RST */
#define IFX_CIF_IRCL_CIF_GLOBAL_RST_OFF (7u)

/** \brief  Length for Ifx_CIF_IRCL_Bits.CIF_ISP_SOFT_RST */
#define IFX_CIF_IRCL_CIF_ISP_SOFT_RST_LEN (1u)

/** \brief  Mask for Ifx_CIF_IRCL_Bits.CIF_ISP_SOFT_RST */
#define IFX_CIF_IRCL_CIF_ISP_SOFT_RST_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_IRCL_Bits.CIF_ISP_SOFT_RST */
#define IFX_CIF_IRCL_CIF_ISP_SOFT_RST_OFF (0u)

