lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_bf.h
/** \brief  Length for Ifx_CIF_IRCL_Bits.CIF_JPEG_SOFT_RST */
#define IFX_CIF_IRCL_CIF_JPEG_SOFT_RST_LEN (1u)

/** \brief  Mask for Ifx_CIF_IRCL_Bits.CIF_JPEG_SOFT_RST */
#define IFX_CIF_IRCL_CIF_JPEG_SOFT_RST_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_IRCL_Bits.CIF_JPEG_SOFT_RST */
#define IFX_CIF_IRCL_CIF_JPEG_SOFT_RST_OFF (5u)

/** \brief  Length for Ifx_CIF_IRCL_Bits.CIF_LIN_DSCALER_RST */
#define IFX_CIF_IRCL_CIF_LIN_DSCALER_RST_LEN (1u)

/** \brief  Mask for Ifx_CIF_IRCL_Bits.CIF_LIN_DSCALER_RST */
#define IFX_CIF_IRCL_CIF_LIN_DSCALER_RST_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_IRCL_Bits.CIF_LIN_DSCALER_RST */
#define IFX_CIF_IRCL_CIF_LIN_DSCALER_RST_OFF (17u)

/** \brief  Length for Ifx_CIF_IRCL_Bits.CIF_MI_SOFT_RST */
#define IFX_CIF_IRCL_CIF_MI_SOFT_RST_LEN (1u)

/** \brief  Mask for Ifx_CIF_IRCL_Bits.CIF_MI_SOFT_RST */
#define IFX_CIF_IRCL_CIF_MI_SOFT_RST_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_IRCL_Bits.CIF_MI_SOFT_RST */
#define IFX_CIF_IRCL_CIF_MI_SOFT_RST_OFF (6u)

/** \brief  Length for Ifx_CIF_IRCL_Bits.CIF_WATCHDOG_RST */
#define IFX_CIF_IRCL_CIF_WATCHDOG_RST_LEN (1u)

/** \brief  Mask for Ifx_CIF_IRCL_Bits.CIF_WATCHDOG_RST */
#define IFX_CIF_IRCL_CIF_WATCHDOG_RST_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_IRCL_Bits.CIF_WATCHDOG_RST */
#define IFX_CIF_IRCL_CIF_WATCHDOG_RST_OFF (16u)

/** \brief  Length for Ifx_CIF_IRCL_Bits.CIF_YCS_SOFT_RST */
#define IFX_CIF_IRCL_CIF_YCS_SOFT_RST_LEN (1u)

/** \brief  Mask for Ifx_CIF_IRCL_Bits.CIF_YCS_SOFT_RST */
#define IFX_CIF_IRCL_CIF_YCS_SOFT_RST_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_IRCL_Bits.CIF_YCS_SOFT_RST */
#define IFX_CIF_IRCL_CIF_YCS_SOFT_RST_OFF (2u)

/** \brief  Length for Ifx_CIF_ISP_ACQ_H_OFFS_Bits.ACQ_H_OFFS */
#define IFX_CIF_ISP_ACQ_H_OFFS_ACQ_H_OFFS_LEN (13u)

/** \brief  Mask for Ifx_CIF_ISP_ACQ_H_OFFS_Bits.ACQ_H_OFFS */
#define IFX_CIF_ISP_ACQ_H_OFFS_ACQ_H_OFFS_MSK (0x1fffu)

/** \brief  Offset for Ifx_CIF_ISP_ACQ_H_OFFS_Bits.ACQ_H_OFFS */
#define IFX_CIF_ISP_ACQ_H_OFFS_ACQ_H_OFFS_OFF (0u)

/** \brief  Length for Ifx_CIF_ISP_ACQ_H_SIZE_Bits.ACQ_H_SIZE */
#define IFX_CIF_ISP_ACQ_H_SIZE_ACQ_H_SIZE_LEN (13u)

/** \brief  Mask for Ifx_CIF_ISP_ACQ_H_SIZE_Bits.ACQ_H_SIZE */
#define IFX_CIF_ISP_ACQ_H_SIZE_ACQ_H_SIZE_MSK (0x1fffu)

/** \brief  Offset for Ifx_CIF_ISP_ACQ_H_SIZE_Bits.ACQ_H_SIZE */
#define IFX_CIF_ISP_ACQ_H_SIZE_ACQ_H_SIZE_OFF (0u)

/** \brief  Length for Ifx_CIF_ISP_ACQ_NR_FRAMES_Bits.ACQ_NR_FRAMES */
#define IFX_CIF_ISP_ACQ_NR_FRAMES_ACQ_NR_FRAMES_LEN (10u)

/** \brief  Mask for Ifx_CIF_ISP_ACQ_NR_FRAMES_Bits.ACQ_NR_FRAMES */
#define IFX_CIF_ISP_ACQ_NR_FRAMES_ACQ_NR_FRAMES_MSK (0x3ffu)

/** \brief  Offset for Ifx_CIF_ISP_ACQ_NR_FRAMES_Bits.ACQ_NR_FRAMES */
#define IFX_CIF_ISP_ACQ_NR_FRAMES_ACQ_NR_FRAMES_OFF (0u)

/** \brief  Length for Ifx_CIF_ISP_ACQ_PROP_Bits.CCIR_SEQ */
#define IFX_CIF_ISP_ACQ_PROP_CCIR_SEQ_LEN (2u)

/** \brief  Mask for Ifx_CIF_ISP_ACQ_PROP_Bits.CCIR_SEQ */
#define IFX_CIF_ISP_ACQ_PROP_CCIR_SEQ_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_ISP_ACQ_PROP_Bits.CCIR_SEQ */
#define IFX_CIF_ISP_ACQ_PROP_CCIR_SEQ_OFF (7u)

/** \brief  Length for Ifx_CIF_ISP_ACQ_PROP_Bits.FIELD_INVERT */
#define IFX_CIF_ISP_ACQ_PROP_FIELD_INVERT_LEN (1u)

/** \brief  Mask for Ifx_CIF_ISP_ACQ_PROP_Bits.FIELD_INVERT */
#define IFX_CIF_ISP_ACQ_PROP_FIELD_INVERT_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ISP_ACQ_PROP_Bits.FIELD_INVERT */
#define IFX_CIF_ISP_ACQ_PROP_FIELD_INVERT_OFF (11u)

/** \brief  Length for Ifx_CIF_ISP_ACQ_PROP_Bits.FIELD_SELECTION */
#define IFX_CIF_ISP_ACQ_PROP_FIELD_SELECTION_LEN (2u)

/** \brief  Mask for Ifx_CIF_ISP_ACQ_PROP_Bits.FIELD_SELECTION */
#define IFX_CIF_ISP_ACQ_PROP_FIELD_SELECTION_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_ISP_ACQ_PROP_Bits.FIELD_SELECTION */
#define IFX_CIF_ISP_ACQ_PROP_FIELD_SELECTION_OFF (9u)

/** \brief  Length for Ifx_CIF_ISP_ACQ_PROP_Bits.HSYNC_POL */
#define IFX_CIF_ISP_ACQ_PROP_HSYNC_POL_LEN (1u)

/** \brief  Mask for Ifx_CIF_ISP_ACQ_PROP_Bits.HSYNC_POL */
#define IFX_CIF_ISP_ACQ_PROP_HSYNC_POL_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ISP_ACQ_PROP_Bits.HSYNC_POL */
#define IFX_CIF_ISP_ACQ_PROP_HSYNC_POL_OFF (1u)

/** \brief  Length for Ifx_CIF_ISP_ACQ_PROP_Bits.INPUT_SELECTION */
#define IFX_CIF_ISP_ACQ_PROP_INPUT_SELECTION_LEN (4u)

/** \brief  Mask for Ifx_CIF_ISP_ACQ_PROP_Bits.INPUT_SELECTION */
#define IFX_CIF_ISP_ACQ_PROP_INPUT_SELECTION_MSK (0xfu)

/** \brief  Length for Ifx_CIF_ISP_ACQ_PROP_Bits.INPUT_SELECTION_NO_APP */
#define IFX_CIF_ISP_ACQ_PROP_INPUT_SELECTION_NO_APP_LEN (1u)

/** \brief  Mask for Ifx_CIF_ISP_ACQ_PROP_Bits.INPUT_SELECTION_NO_APP */
#define IFX_CIF_ISP_ACQ_PROP_INPUT_SELECTION_NO_APP_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ISP_ACQ_PROP_Bits.INPUT_SELECTION_NO_APP */
#define IFX_CIF_ISP_ACQ_PROP_INPUT_SELECTION_NO_APP_OFF (20u)

/** \brief  Offset for Ifx_CIF_ISP_ACQ_PROP_Bits.INPUT_SELECTION */
#define IFX_CIF_ISP_ACQ_PROP_INPUT_SELECTION_OFF (12u)

/** \brief  Length for Ifx_CIF_ISP_ACQ_PROP_Bits.SAMPLE_EDGE */
#define IFX_CIF_ISP_ACQ_PROP_SAMPLE_EDGE_LEN (1u)

/** \brief  Mask for Ifx_CIF_ISP_ACQ_PROP_Bits.SAMPLE_EDGE */
#define IFX_CIF_ISP_ACQ_PROP_SAMPLE_EDGE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ISP_ACQ_PROP_Bits.SAMPLE_EDGE */
#define IFX_CIF_ISP_ACQ_PROP_SAMPLE_EDGE_OFF (0u)

/** \brief  Length for Ifx_CIF_ISP_ACQ_PROP_Bits.VSYNC_POL */
#define IFX_CIF_ISP_ACQ_PROP_VSYNC_POL_LEN (1u)

/** \brief  Mask for Ifx_CIF_ISP_ACQ_PROP_Bits.VSYNC_POL */
#define IFX_CIF_ISP_ACQ_PROP_VSYNC_POL_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ISP_ACQ_PROP_Bits.VSYNC_POL */
#define IFX_CIF_ISP_ACQ_PROP_VSYNC_POL_OFF (2u)

/** \brief  Length for Ifx_CIF_ISP_ACQ_V_OFFS_Bits.ACQ_V_OFFS */
#define IFX_CIF_ISP_ACQ_V_OFFS_ACQ_V_OFFS_LEN (12u)

/** \brief  Mask for Ifx_CIF_ISP_ACQ_V_OFFS_Bits.ACQ_V_OFFS */
#define IFX_CIF_ISP_ACQ_V_OFFS_ACQ_V_OFFS_MSK (0xfffu)

/** \brief  Offset for Ifx_CIF_ISP_ACQ_V_OFFS_Bits.ACQ_V_OFFS */
#define IFX_CIF_ISP_ACQ_V_OFFS_ACQ_V_OFFS_OFF (0u)

/** \brief  Length for Ifx_CIF_ISP_ACQ_V_SIZE_Bits.ACQ_V_SIZE */
#define IFX_CIF_ISP_ACQ_V_SIZE_ACQ_V_SIZE_LEN (12u)

/** \brief  Mask for Ifx_CIF_ISP_ACQ_V_SIZE_Bits.ACQ_V_SIZE */
#define IFX_CIF_ISP_ACQ_V_SIZE_ACQ_V_SIZE_MSK (0xfffu)

/** \brief  Offset for Ifx_CIF_ISP_ACQ_V_SIZE_Bits.ACQ_V_SIZE */
#define IFX_CIF_ISP_ACQ_V_SIZE_ACQ_V_SIZE_OFF (0u)

/** \brief  Length for Ifx_CIF_ISP_CTRL_Bits.ISP_CFG_UPD */
#define IFX_CIF_ISP_CTRL_ISP_CFG_UPD_LEN (1u)

