lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_bf.h
/** \brief  Length for Ifx_CIF_ISP_FRAME_COUNT_Bits.FRAME_COUNTER */
#define IFX_CIF_ISP_FRAME_COUNT_FRAME_COUNTER_LEN (10u)

/** \brief  Mask for Ifx_CIF_ISP_FRAME_COUNT_Bits.FRAME_COUNTER */
#define IFX_CIF_ISP_FRAME_COUNT_FRAME_COUNTER_MSK (0x3ffu)

/** \brief  Offset for Ifx_CIF_ISP_FRAME_COUNT_Bits.FRAME_COUNTER */
#define IFX_CIF_ISP_FRAME_COUNT_FRAME_COUNTER_OFF (0u)

/** \brief  Length for Ifx_CIF_ISP_ICR_Bits.ICR_DATA_LOSS */
#define IFX_CIF_ISP_ICR_ICR_DATA_LOSS_LEN (1u)

/** \brief  Mask for Ifx_CIF_ISP_ICR_Bits.ICR_DATA_LOSS */
#define IFX_CIF_ISP_ICR_ICR_DATA_LOSS_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ISP_ICR_Bits.ICR_DATA_LOSS */
#define IFX_CIF_ISP_ICR_ICR_DATA_LOSS_OFF (2u)

/** \brief  Length for Ifx_CIF_ISP_ICR_Bits.ICR_FRAME_IN */
#define IFX_CIF_ISP_ICR_ICR_FRAME_IN_LEN (1u)

/** \brief  Mask for Ifx_CIF_ISP_ICR_Bits.ICR_FRAME_IN */
#define IFX_CIF_ISP_ICR_ICR_FRAME_IN_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ISP_ICR_Bits.ICR_FRAME_IN */
#define IFX_CIF_ISP_ICR_ICR_FRAME_IN_OFF (5u)

/** \brief  Length for Ifx_CIF_ISP_ICR_Bits.ICR_FRAME */
#define IFX_CIF_ISP_ICR_ICR_FRAME_LEN (1u)

/** \brief  Mask for Ifx_CIF_ISP_ICR_Bits.ICR_FRAME */
#define IFX_CIF_ISP_ICR_ICR_FRAME_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ISP_ICR_Bits.ICR_FRAME */
#define IFX_CIF_ISP_ICR_ICR_FRAME_OFF (1u)

/** \brief  Length for Ifx_CIF_ISP_ICR_Bits.ICR_H_START */
#define IFX_CIF_ISP_ICR_ICR_H_START_LEN (1u)

/** \brief  Mask for Ifx_CIF_ISP_ICR_Bits.ICR_H_START */
#define IFX_CIF_ISP_ICR_ICR_H_START_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ISP_ICR_Bits.ICR_H_START */
#define IFX_CIF_ISP_ICR_ICR_H_START_OFF (7u)

/** \brief  Length for Ifx_CIF_ISP_ICR_Bits.ICR_ISP_OFF */
#define IFX_CIF_ISP_ICR_ICR_ISP_OFF_LEN (1u)

/** \brief  Mask for Ifx_CIF_ISP_ICR_Bits.ICR_ISP_OFF */
#define IFX_CIF_ISP_ICR_ICR_ISP_OFF_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ISP_ICR_Bits.ICR_ISP_OFF */
#define IFX_CIF_ISP_ICR_ICR_ISP_OFF_OFF (0u)

/** \brief  Length for Ifx_CIF_ISP_ICR_Bits.ICR_PIC_SIZE_ERR */
#define IFX_CIF_ISP_ICR_ICR_PIC_SIZE_ERR_LEN (1u)

/** \brief  Mask for Ifx_CIF_ISP_ICR_Bits.ICR_PIC_SIZE_ERR */
#define IFX_CIF_ISP_ICR_ICR_PIC_SIZE_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ISP_ICR_Bits.ICR_PIC_SIZE_ERR */
#define IFX_CIF_ISP_ICR_ICR_PIC_SIZE_ERR_OFF (3u)

/** \brief  Length for Ifx_CIF_ISP_ICR_Bits.ICR_V_START */
#define IFX_CIF_ISP_ICR_ICR_V_START_LEN (1u)

/** \brief  Mask for Ifx_CIF_ISP_ICR_Bits.ICR_V_START */
#define IFX_CIF_ISP_ICR_ICR_V_START_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ISP_ICR_Bits.ICR_V_START */
#define IFX_CIF_ISP_ICR_ICR_V_START_OFF (6u)

/** \brief  Length for Ifx_CIF_ISP_ICR_Bits.ICR_WD_TRIG */
#define IFX_CIF_ISP_ICR_ICR_WD_TRIG_LEN (1u)

/** \brief  Mask for Ifx_CIF_ISP_ICR_Bits.ICR_WD_TRIG */
#define IFX_CIF_ISP_ICR_ICR_WD_TRIG_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ISP_ICR_Bits.ICR_WD_TRIG */
#define IFX_CIF_ISP_ICR_ICR_WD_TRIG_OFF (19u)

/** \brief  Length for Ifx_CIF_ISP_IMSC_Bits.IMSC_DATA_LOSS */
#define IFX_CIF_ISP_IMSC_IMSC_DATA_LOSS_LEN (1u)

/** \brief  Mask for Ifx_CIF_ISP_IMSC_Bits.IMSC_DATA_LOSS */
#define IFX_CIF_ISP_IMSC_IMSC_DATA_LOSS_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ISP_IMSC_Bits.IMSC_DATA_LOSS */
#define IFX_CIF_ISP_IMSC_IMSC_DATA_LOSS_OFF (2u)

/** \brief  Length for Ifx_CIF_ISP_IMSC_Bits.IMSC_FRAME_IN */
#define IFX_CIF_ISP_IMSC_IMSC_FRAME_IN_LEN (1u)

/** \brief  Mask for Ifx_CIF_ISP_IMSC_Bits.IMSC_FRAME_IN */
#define IFX_CIF_ISP_IMSC_IMSC_FRAME_IN_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ISP_IMSC_Bits.IMSC_FRAME_IN */
#define IFX_CIF_ISP_IMSC_IMSC_FRAME_IN_OFF (5u)

/** \brief  Length for Ifx_CIF_ISP_IMSC_Bits.IMSC_FRAME */
#define IFX_CIF_ISP_IMSC_IMSC_FRAME_LEN (1u)

/** \brief  Mask for Ifx_CIF_ISP_IMSC_Bits.IMSC_FRAME */
#define IFX_CIF_ISP_IMSC_IMSC_FRAME_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ISP_IMSC_Bits.IMSC_FRAME */
#define IFX_CIF_ISP_IMSC_IMSC_FRAME_OFF (1u)

/** \brief  Length for Ifx_CIF_ISP_IMSC_Bits.IMSC_H_START */
#define IFX_CIF_ISP_IMSC_IMSC_H_START_LEN (1u)

/** \brief  Mask for Ifx_CIF_ISP_IMSC_Bits.IMSC_H_START */
#define IFX_CIF_ISP_IMSC_IMSC_H_START_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ISP_IMSC_Bits.IMSC_H_START */
#define IFX_CIF_ISP_IMSC_IMSC_H_START_OFF (7u)

/** \brief  Length for Ifx_CIF_ISP_IMSC_Bits.IMSC_ISP_OFF */
#define IFX_CIF_ISP_IMSC_IMSC_ISP_OFF_LEN (1u)

/** \brief  Mask for Ifx_CIF_ISP_IMSC_Bits.IMSC_ISP_OFF */
#define IFX_CIF_ISP_IMSC_IMSC_ISP_OFF_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ISP_IMSC_Bits.IMSC_ISP_OFF */
#define IFX_CIF_ISP_IMSC_IMSC_ISP_OFF_OFF (0u)

/** \brief  Length for Ifx_CIF_ISP_IMSC_Bits.IMSC_PIC_SIZE_ERR */
#define IFX_CIF_ISP_IMSC_IMSC_PIC_SIZE_ERR_LEN (1u)

/** \brief  Mask for Ifx_CIF_ISP_IMSC_Bits.IMSC_PIC_SIZE_ERR */
#define IFX_CIF_ISP_IMSC_IMSC_PIC_SIZE_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ISP_IMSC_Bits.IMSC_PIC_SIZE_ERR */
#define IFX_CIF_ISP_IMSC_IMSC_PIC_SIZE_ERR_OFF (3u)

/** \brief  Length for Ifx_CIF_ISP_IMSC_Bits.IMSC_V_START */
#define IFX_CIF_ISP_IMSC_IMSC_V_START_LEN (1u)

/** \brief  Mask for Ifx_CIF_ISP_IMSC_Bits.IMSC_V_START */
#define IFX_CIF_ISP_IMSC_IMSC_V_START_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ISP_IMSC_Bits.IMSC_V_START */
#define IFX_CIF_ISP_IMSC_IMSC_V_START_OFF (6u)

/** \brief  Length for Ifx_CIF_ISP_IMSC_Bits.IMSC_WD_TRIG */
#define IFX_CIF_ISP_IMSC_IMSC_WD_TRIG_LEN (1u)

/** \brief  Mask for Ifx_CIF_ISP_IMSC_Bits.IMSC_WD_TRIG */
#define IFX_CIF_ISP_IMSC_IMSC_WD_TRIG_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ISP_IMSC_Bits.IMSC_WD_TRIG */
#define IFX_CIF_ISP_IMSC_IMSC_WD_TRIG_OFF (19u)

/** \brief  Length for Ifx_CIF_ISP_ISR_Bits.ISR_DATA_LOSS */
#define IFX_CIF_ISP_ISR_ISR_DATA_LOSS_LEN (1u)

/** \brief  Mask for Ifx_CIF_ISP_ISR_Bits.ISR_DATA_LOSS */
#define IFX_CIF_ISP_ISR_ISR_DATA_LOSS_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_ISP_ISR_Bits.ISR_DATA_LOSS */
#define IFX_CIF_ISP_ISR_ISR_DATA_LOSS_OFF (2u)

/** \brief  Length for Ifx_CIF_ISP_ISR_Bits.ISR_FRAME_IN */
#define IFX_CIF_ISP_ISR_ISR_FRAME_IN_LEN (1u)

/** \brief  Mask for Ifx_CIF_ISP_ISR_Bits.ISR_FRAME_IN */
#define IFX_CIF_ISP_ISR_ISR_FRAME_IN_MSK (0x1u)

