lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_bf.h
/** \brief  Offset for Ifx_CIF_JPE_DEBUG_Bits.DEB_VLC_TABLE_BUSY */
#define IFX_CIF_JPE_DEBUG_DEB_VLC_TABLE_BUSY_OFF (5u)

/** \brief  Length for Ifx_CIF_JPE_ENC_HSIZE_Bits.ENC_HSIZE */
#define IFX_CIF_JPE_ENC_HSIZE_ENC_HSIZE_LEN (12u)

/** \brief  Mask for Ifx_CIF_JPE_ENC_HSIZE_Bits.ENC_HSIZE */
#define IFX_CIF_JPE_ENC_HSIZE_ENC_HSIZE_MSK (0xfffu)

/** \brief  Offset for Ifx_CIF_JPE_ENC_HSIZE_Bits.ENC_HSIZE */
#define IFX_CIF_JPE_ENC_HSIZE_ENC_HSIZE_OFF (0u)

/** \brief  Length for Ifx_CIF_JPE_ENC_VSIZE_Bits.ENC_VSIZE */
#define IFX_CIF_JPE_ENC_VSIZE_ENC_VSIZE_LEN (12u)

/** \brief  Mask for Ifx_CIF_JPE_ENC_VSIZE_Bits.ENC_VSIZE */
#define IFX_CIF_JPE_ENC_VSIZE_ENC_VSIZE_MSK (0xfffu)

/** \brief  Offset for Ifx_CIF_JPE_ENC_VSIZE_Bits.ENC_VSIZE */
#define IFX_CIF_JPE_ENC_VSIZE_ENC_VSIZE_OFF (0u)

/** \brief  Length for Ifx_CIF_JPE_ENCODE_Bits.CONT_MODE */
#define IFX_CIF_JPE_ENCODE_CONT_MODE_LEN (2u)

/** \brief  Mask for Ifx_CIF_JPE_ENCODE_Bits.CONT_MODE */
#define IFX_CIF_JPE_ENCODE_CONT_MODE_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_JPE_ENCODE_Bits.CONT_MODE */
#define IFX_CIF_JPE_ENCODE_CONT_MODE_OFF (4u)

/** \brief  Length for Ifx_CIF_JPE_ENCODE_Bits.ENCODE */
#define IFX_CIF_JPE_ENCODE_ENCODE_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_ENCODE_Bits.ENCODE */
#define IFX_CIF_JPE_ENCODE_ENCODE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_ENCODE_Bits.ENCODE */
#define IFX_CIF_JPE_ENCODE_ENCODE_OFF (0u)

/** \brief  Length for Ifx_CIF_JPE_ENCODE_MODE_Bits.ENCODE_MODE */
#define IFX_CIF_JPE_ENCODE_MODE_ENCODE_MODE_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_ENCODE_MODE_Bits.ENCODE_MODE */
#define IFX_CIF_JPE_ENCODE_MODE_ENCODE_MODE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_ENCODE_MODE_Bits.ENCODE_MODE */
#define IFX_CIF_JPE_ENCODE_MODE_ENCODE_MODE_OFF (0u)

/** \brief  Length for Ifx_CIF_JPE_ENCODER_BUSY_Bits.CODEC_BUSY */
#define IFX_CIF_JPE_ENCODER_BUSY_CODEC_BUSY_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_ENCODER_BUSY_Bits.CODEC_BUSY */
#define IFX_CIF_JPE_ENCODER_BUSY_CODEC_BUSY_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_ENCODER_BUSY_Bits.CODEC_BUSY */
#define IFX_CIF_JPE_ENCODER_BUSY_CODEC_BUSY_OFF (0u)

/** \brief  Length for Ifx_CIF_JPE_ERROR_ICR_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_ICR_DCT_ERR_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_ERROR_ICR_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_ICR_DCT_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_ERROR_ICR_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_ICR_DCT_ERR_OFF (7u)

/** \brief  Length for Ifx_CIF_JPE_ERROR_ICR_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_ICR_R2B_IMG_SIZE_ERR_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_ERROR_ICR_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_ICR_R2B_IMG_SIZE_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_ERROR_ICR_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_ICR_R2B_IMG_SIZE_ERR_OFF (9u)

/** \brief  Length for Ifx_CIF_JPE_ERROR_ICR_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_ICR_VLC_SYMBOL_ERR_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_ERROR_ICR_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_ICR_VLC_SYMBOL_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_ERROR_ICR_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_ICR_VLC_SYMBOL_ERR_OFF (4u)

/** \brief  Length for Ifx_CIF_JPE_ERROR_ICR_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_ICR_VLC_TABLE_ERR_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_ERROR_ICR_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_ICR_VLC_TABLE_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_ERROR_ICR_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_ICR_VLC_TABLE_ERR_OFF (10u)

/** \brief  Length for Ifx_CIF_JPE_ERROR_IMR_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_IMR_DCT_ERR_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_ERROR_IMR_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_IMR_DCT_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_ERROR_IMR_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_IMR_DCT_ERR_OFF (7u)

/** \brief  Length for Ifx_CIF_JPE_ERROR_IMR_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_IMR_R2B_IMG_SIZE_ERR_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_ERROR_IMR_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_IMR_R2B_IMG_SIZE_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_ERROR_IMR_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_IMR_R2B_IMG_SIZE_ERR_OFF (9u)

/** \brief  Length for Ifx_CIF_JPE_ERROR_IMR_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_IMR_VLC_SYMBOL_ERR_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_ERROR_IMR_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_IMR_VLC_SYMBOL_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_ERROR_IMR_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_IMR_VLC_SYMBOL_ERR_OFF (4u)

/** \brief  Length for Ifx_CIF_JPE_ERROR_IMR_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_IMR_VLC_TABLE_ERR_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_ERROR_IMR_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_IMR_VLC_TABLE_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_ERROR_IMR_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_IMR_VLC_TABLE_ERR_OFF (10u)

/** \brief  Length for Ifx_CIF_JPE_ERROR_ISR_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_ISR_DCT_ERR_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_ERROR_ISR_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_ISR_DCT_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_ERROR_ISR_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_ISR_DCT_ERR_OFF (7u)

/** \brief  Length for Ifx_CIF_JPE_ERROR_ISR_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_ISR_R2B_IMG_SIZE_ERR_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_ERROR_ISR_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_ISR_R2B_IMG_SIZE_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_ERROR_ISR_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_ISR_R2B_IMG_SIZE_ERR_OFF (9u)

/** \brief  Length for Ifx_CIF_JPE_ERROR_ISR_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_ISR_VLC_SYMBOL_ERR_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_ERROR_ISR_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_ISR_VLC_SYMBOL_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_ERROR_ISR_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_ISR_VLC_SYMBOL_ERR_OFF (4u)

/** \brief  Length for Ifx_CIF_JPE_ERROR_ISR_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_ISR_VLC_TABLE_ERR_LEN (1u)

