lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_bf.h
/** \brief  Mask for Ifx_CIF_JPE_ERROR_ISR_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_ISR_VLC_TABLE_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_ERROR_ISR_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_ISR_VLC_TABLE_ERR_OFF (10u)

/** \brief  Length for Ifx_CIF_JPE_ERROR_MIS_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_MIS_DCT_ERR_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_ERROR_MIS_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_MIS_DCT_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_ERROR_MIS_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_MIS_DCT_ERR_OFF (7u)

/** \brief  Length for Ifx_CIF_JPE_ERROR_MIS_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_MIS_R2B_IMG_SIZE_ERR_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_ERROR_MIS_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_MIS_R2B_IMG_SIZE_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_ERROR_MIS_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_MIS_R2B_IMG_SIZE_ERR_OFF (9u)

/** \brief  Length for Ifx_CIF_JPE_ERROR_MIS_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_MIS_VLC_SYMBOL_ERR_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_ERROR_MIS_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_MIS_VLC_SYMBOL_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_ERROR_MIS_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_MIS_VLC_SYMBOL_ERR_OFF (4u)

/** \brief  Length for Ifx_CIF_JPE_ERROR_MIS_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_MIS_VLC_TABLE_ERR_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_ERROR_MIS_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_MIS_VLC_TABLE_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_ERROR_MIS_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_MIS_VLC_TABLE_ERR_OFF (10u)

/** \brief  Length for Ifx_CIF_JPE_ERROR_RIS_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_RIS_DCT_ERR_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_ERROR_RIS_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_RIS_DCT_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_ERROR_RIS_Bits.DCT_ERR */
#define IFX_CIF_JPE_ERROR_RIS_DCT_ERR_OFF (7u)

/** \brief  Length for Ifx_CIF_JPE_ERROR_RIS_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_RIS_R2B_IMG_SIZE_ERR_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_ERROR_RIS_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_RIS_R2B_IMG_SIZE_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_ERROR_RIS_Bits.R2B_IMG_SIZE_ERR */
#define IFX_CIF_JPE_ERROR_RIS_R2B_IMG_SIZE_ERR_OFF (9u)

/** \brief  Length for Ifx_CIF_JPE_ERROR_RIS_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_RIS_VLC_SYMBOL_ERR_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_ERROR_RIS_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_RIS_VLC_SYMBOL_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_ERROR_RIS_Bits.VLC_SYMBOL_ERR */
#define IFX_CIF_JPE_ERROR_RIS_VLC_SYMBOL_ERR_OFF (4u)

/** \brief  Length for Ifx_CIF_JPE_ERROR_RIS_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_RIS_VLC_TABLE_ERR_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_ERROR_RIS_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_RIS_VLC_TABLE_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_ERROR_RIS_Bits.VLC_TABLE_ERR */
#define IFX_CIF_JPE_ERROR_RIS_VLC_TABLE_ERR_OFF (10u)

/** \brief  Length for Ifx_CIF_JPE_GEN_HEADER_Bits.GEN_HEADER */
#define IFX_CIF_JPE_GEN_HEADER_GEN_HEADER_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_GEN_HEADER_Bits.GEN_HEADER */
#define IFX_CIF_JPE_GEN_HEADER_GEN_HEADER_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_GEN_HEADER_Bits.GEN_HEADER */
#define IFX_CIF_JPE_GEN_HEADER_GEN_HEADER_OFF (0u)

/** \brief  Length for Ifx_CIF_JPE_HEADER_MODE_Bits.HEADER_MODE */
#define IFX_CIF_JPE_HEADER_MODE_HEADER_MODE_LEN (2u)

/** \brief  Mask for Ifx_CIF_JPE_HEADER_MODE_Bits.HEADER_MODE */
#define IFX_CIF_JPE_HEADER_MODE_HEADER_MODE_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_JPE_HEADER_MODE_Bits.HEADER_MODE */
#define IFX_CIF_JPE_HEADER_MODE_HEADER_MODE_OFF (0u)

/** \brief  Length for Ifx_CIF_JPE_INIT_Bits.JP_INIT */
#define IFX_CIF_JPE_INIT_JP_INIT_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_INIT_Bits.JP_INIT */
#define IFX_CIF_JPE_INIT_JP_INIT_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_INIT_Bits.JP_INIT */
#define IFX_CIF_JPE_INIT_JP_INIT_OFF (0u)

/** \brief  Length for Ifx_CIF_JPE_PIC_FORMAT_Bits.ENC_PIC_FORMAT */
#define IFX_CIF_JPE_PIC_FORMAT_ENC_PIC_FORMAT_LEN (3u)

/** \brief  Mask for Ifx_CIF_JPE_PIC_FORMAT_Bits.ENC_PIC_FORMAT */
#define IFX_CIF_JPE_PIC_FORMAT_ENC_PIC_FORMAT_MSK (0x7u)

/** \brief  Offset for Ifx_CIF_JPE_PIC_FORMAT_Bits.ENC_PIC_FORMAT */
#define IFX_CIF_JPE_PIC_FORMAT_ENC_PIC_FORMAT_OFF (0u)

/** \brief  Length for Ifx_CIF_JPE_RESTART_INTERVAL_Bits.RESTART_INTERVAL */
#define IFX_CIF_JPE_RESTART_INTERVAL_RESTART_INTERVAL_LEN (16u)

/** \brief  Mask for Ifx_CIF_JPE_RESTART_INTERVAL_Bits.RESTART_INTERVAL */
#define IFX_CIF_JPE_RESTART_INTERVAL_RESTART_INTERVAL_MSK (0xffffu)

/** \brief  Offset for Ifx_CIF_JPE_RESTART_INTERVAL_Bits.RESTART_INTERVAL */
#define IFX_CIF_JPE_RESTART_INTERVAL_RESTART_INTERVAL_OFF (0u)

/** \brief  Length for Ifx_CIF_JPE_STATUS_ICR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_ICR_ENCODE_DONE_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_STATUS_ICR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_ICR_ENCODE_DONE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_STATUS_ICR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_ICR_ENCODE_DONE_OFF (4u)

/** \brief  Length for Ifx_CIF_JPE_STATUS_ICR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_ICR_GEN_HEADER_DONE_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_STATUS_ICR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_ICR_GEN_HEADER_DONE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_STATUS_ICR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_ICR_GEN_HEADER_DONE_OFF (5u)

/** \brief  Length for Ifx_CIF_JPE_STATUS_IMR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_IMR_ENCODE_DONE_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_STATUS_IMR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_IMR_ENCODE_DONE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_STATUS_IMR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_IMR_ENCODE_DONE_OFF (4u)

/** \brief  Length for Ifx_CIF_JPE_STATUS_IMR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_IMR_GEN_HEADER_DONE_LEN (1u)

