lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_bf.h
/** \brief  Mask for Ifx_CIF_JPE_STATUS_IMR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_IMR_GEN_HEADER_DONE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_STATUS_IMR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_IMR_GEN_HEADER_DONE_OFF (5u)

/** \brief  Length for Ifx_CIF_JPE_STATUS_ISR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_ISR_ENCODE_DONE_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_STATUS_ISR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_ISR_ENCODE_DONE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_STATUS_ISR_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_ISR_ENCODE_DONE_OFF (4u)

/** \brief  Length for Ifx_CIF_JPE_STATUS_ISR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_ISR_GEN_HEADER_DONE_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_STATUS_ISR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_ISR_GEN_HEADER_DONE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_STATUS_ISR_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_ISR_GEN_HEADER_DONE_OFF (5u)

/** \brief  Length for Ifx_CIF_JPE_STATUS_MIS_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_MIS_ENCODE_DONE_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_STATUS_MIS_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_MIS_ENCODE_DONE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_STATUS_MIS_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_MIS_ENCODE_DONE_OFF (4u)

/** \brief  Length for Ifx_CIF_JPE_STATUS_MIS_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_MIS_GEN_HEADER_DONE_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_STATUS_MIS_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_MIS_GEN_HEADER_DONE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_STATUS_MIS_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_MIS_GEN_HEADER_DONE_OFF (5u)

/** \brief  Length for Ifx_CIF_JPE_STATUS_RIS_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_RIS_ENCODE_DONE_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_STATUS_RIS_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_RIS_ENCODE_DONE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_STATUS_RIS_Bits.ENCODE_DONE */
#define IFX_CIF_JPE_STATUS_RIS_ENCODE_DONE_OFF (4u)

/** \brief  Length for Ifx_CIF_JPE_STATUS_RIS_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_RIS_GEN_HEADER_DONE_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_STATUS_RIS_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_RIS_GEN_HEADER_DONE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_STATUS_RIS_Bits.GEN_HEADER_DONE */
#define IFX_CIF_JPE_STATUS_RIS_GEN_HEADER_DONE_OFF (5u)

/** \brief  Length for Ifx_CIF_JPE_TABLE_DATA_Bits.TABLE_WDATA_H */
#define IFX_CIF_JPE_TABLE_DATA_TABLE_WDATA_H_LEN (8u)

/** \brief  Mask for Ifx_CIF_JPE_TABLE_DATA_Bits.TABLE_WDATA_H */
#define IFX_CIF_JPE_TABLE_DATA_TABLE_WDATA_H_MSK (0xffu)

/** \brief  Offset for Ifx_CIF_JPE_TABLE_DATA_Bits.TABLE_WDATA_H */
#define IFX_CIF_JPE_TABLE_DATA_TABLE_WDATA_H_OFF (8u)

/** \brief  Length for Ifx_CIF_JPE_TABLE_DATA_Bits.TABLE_WDATA_L */
#define IFX_CIF_JPE_TABLE_DATA_TABLE_WDATA_L_LEN (8u)

/** \brief  Mask for Ifx_CIF_JPE_TABLE_DATA_Bits.TABLE_WDATA_L */
#define IFX_CIF_JPE_TABLE_DATA_TABLE_WDATA_L_MSK (0xffu)

/** \brief  Offset for Ifx_CIF_JPE_TABLE_DATA_Bits.TABLE_WDATA_L */
#define IFX_CIF_JPE_TABLE_DATA_TABLE_WDATA_L_OFF (0u)

/** \brief  Length for Ifx_CIF_JPE_TABLE_FLUSH_Bits.TABLE_FLUSH */
#define IFX_CIF_JPE_TABLE_FLUSH_TABLE_FLUSH_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_TABLE_FLUSH_Bits.TABLE_FLUSH */
#define IFX_CIF_JPE_TABLE_FLUSH_TABLE_FLUSH_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_TABLE_FLUSH_Bits.TABLE_FLUSH */
#define IFX_CIF_JPE_TABLE_FLUSH_TABLE_FLUSH_OFF (0u)

/** \brief  Length for Ifx_CIF_JPE_TABLE_ID_Bits.TABLE_ID */
#define IFX_CIF_JPE_TABLE_ID_TABLE_ID_LEN (4u)

/** \brief  Mask for Ifx_CIF_JPE_TABLE_ID_Bits.TABLE_ID */
#define IFX_CIF_JPE_TABLE_ID_TABLE_ID_MSK (0xfu)

/** \brief  Offset for Ifx_CIF_JPE_TABLE_ID_Bits.TABLE_ID */
#define IFX_CIF_JPE_TABLE_ID_TABLE_ID_OFF (0u)

/** \brief  Length for Ifx_CIF_JPE_TAC0_LEN_Bits.TAC0_LEN */
#define IFX_CIF_JPE_TAC0_LEN_TAC0_LEN_LEN (8u)

/** \brief  Mask for Ifx_CIF_JPE_TAC0_LEN_Bits.TAC0_LEN */
#define IFX_CIF_JPE_TAC0_LEN_TAC0_LEN_MSK (0xffu)

/** \brief  Offset for Ifx_CIF_JPE_TAC0_LEN_Bits.TAC0_LEN */
#define IFX_CIF_JPE_TAC0_LEN_TAC0_LEN_OFF (0u)

/** \brief  Length for Ifx_CIF_JPE_TAC1_LEN_Bits.TAC1_LEN */
#define IFX_CIF_JPE_TAC1_LEN_TAC1_LEN_LEN (8u)

/** \brief  Mask for Ifx_CIF_JPE_TAC1_LEN_Bits.TAC1_LEN */
#define IFX_CIF_JPE_TAC1_LEN_TAC1_LEN_MSK (0xffu)

/** \brief  Offset for Ifx_CIF_JPE_TAC1_LEN_Bits.TAC1_LEN */
#define IFX_CIF_JPE_TAC1_LEN_TAC1_LEN_OFF (0u)

/** \brief  Length for Ifx_CIF_JPE_TDC0_LEN_Bits.TDC0_LEN */
#define IFX_CIF_JPE_TDC0_LEN_TDC0_LEN_LEN (8u)

/** \brief  Mask for Ifx_CIF_JPE_TDC0_LEN_Bits.TDC0_LEN */
#define IFX_CIF_JPE_TDC0_LEN_TDC0_LEN_MSK (0xffu)

/** \brief  Offset for Ifx_CIF_JPE_TDC0_LEN_Bits.TDC0_LEN */
#define IFX_CIF_JPE_TDC0_LEN_TDC0_LEN_OFF (0u)

/** \brief  Length for Ifx_CIF_JPE_TDC1_LEN_Bits.TDC1_LEN */
#define IFX_CIF_JPE_TDC1_LEN_TDC1_LEN_LEN (8u)

/** \brief  Mask for Ifx_CIF_JPE_TDC1_LEN_Bits.TDC1_LEN */
#define IFX_CIF_JPE_TDC1_LEN_TDC1_LEN_MSK (0xffu)

/** \brief  Offset for Ifx_CIF_JPE_TDC1_LEN_Bits.TDC1_LEN */
#define IFX_CIF_JPE_TDC1_LEN_TDC1_LEN_OFF (0u)

/** \brief  Length for Ifx_CIF_JPE_TQ_U_SELECT_Bits.TQ1_SELECT */
#define IFX_CIF_JPE_TQ_U_SELECT_TQ1_SELECT_LEN (2u)

/** \brief  Mask for Ifx_CIF_JPE_TQ_U_SELECT_Bits.TQ1_SELECT */
#define IFX_CIF_JPE_TQ_U_SELECT_TQ1_SELECT_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_JPE_TQ_U_SELECT_Bits.TQ1_SELECT */
#define IFX_CIF_JPE_TQ_U_SELECT_TQ1_SELECT_OFF (0u)

/** \brief  Length for Ifx_CIF_JPE_TQ_V_SELECT_Bits.TQ2_SELECT */
#define IFX_CIF_JPE_TQ_V_SELECT_TQ2_SELECT_LEN (2u)

/** \brief  Mask for Ifx_CIF_JPE_TQ_V_SELECT_Bits.TQ2_SELECT */
#define IFX_CIF_JPE_TQ_V_SELECT_TQ2_SELECT_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_JPE_TQ_V_SELECT_Bits.TQ2_SELECT */
#define IFX_CIF_JPE_TQ_V_SELECT_TQ2_SELECT_OFF (0u)

/** \brief  Length for Ifx_CIF_JPE_TQ_Y_SELECT_Bits.TQ0_SELECT */
#define IFX_CIF_JPE_TQ_Y_SELECT_TQ0_SELECT_LEN (2u)

/** \brief  Mask for Ifx_CIF_JPE_TQ_Y_SELECT_Bits.TQ0_SELECT */
#define IFX_CIF_JPE_TQ_Y_SELECT_TQ0_SELECT_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_JPE_TQ_Y_SELECT_Bits.TQ0_SELECT */
#define IFX_CIF_JPE_TQ_Y_SELECT_TQ0_SELECT_OFF (0u)

/** \brief  Length for Ifx_CIF_JPE_Y_SCALE_EN_Bits.Y_SCALE_EN */
#define IFX_CIF_JPE_Y_SCALE_EN_Y_SCALE_EN_LEN (1u)

/** \brief  Mask for Ifx_CIF_JPE_Y_SCALE_EN_Bits.Y_SCALE_EN */
#define IFX_CIF_JPE_Y_SCALE_EN_Y_SCALE_EN_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_JPE_Y_SCALE_EN_Bits.Y_SCALE_EN */
#define IFX_CIF_JPE_Y_SCALE_EN_Y_SCALE_EN_OFF (0u)

