lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_bf.h
/** \brief  Length for Ifx_CIF_LDS_CTRL_Bits.LDS_H_EN */
#define IFX_CIF_LDS_CTRL_LDS_H_EN_LEN (1u)

/** \brief  Mask for Ifx_CIF_LDS_CTRL_Bits.LDS_H_EN */
#define IFX_CIF_LDS_CTRL_LDS_H_EN_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_LDS_CTRL_Bits.LDS_H_EN */
#define IFX_CIF_LDS_CTRL_LDS_H_EN_OFF (1u)

/** \brief  Length for Ifx_CIF_LDS_CTRL_Bits.LDS_H_MODE */
#define IFX_CIF_LDS_CTRL_LDS_H_MODE_LEN (2u)

/** \brief  Mask for Ifx_CIF_LDS_CTRL_Bits.LDS_H_MODE */
#define IFX_CIF_LDS_CTRL_LDS_H_MODE_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_LDS_CTRL_Bits.LDS_H_MODE */
#define IFX_CIF_LDS_CTRL_LDS_H_MODE_OFF (8u)

/** \brief  Length for Ifx_CIF_LDS_CTRL_Bits.LDS_V_EN */
#define IFX_CIF_LDS_CTRL_LDS_V_EN_LEN (1u)

/** \brief  Mask for Ifx_CIF_LDS_CTRL_Bits.LDS_V_EN */
#define IFX_CIF_LDS_CTRL_LDS_V_EN_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_LDS_CTRL_Bits.LDS_V_EN */
#define IFX_CIF_LDS_CTRL_LDS_V_EN_OFF (0u)

/** \brief  Length for Ifx_CIF_LDS_CTRL_Bits.LDS_V_MODE */
#define IFX_CIF_LDS_CTRL_LDS_V_MODE_LEN (2u)

/** \brief  Mask for Ifx_CIF_LDS_CTRL_Bits.LDS_V_MODE */
#define IFX_CIF_LDS_CTRL_LDS_V_MODE_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_LDS_CTRL_Bits.LDS_V_MODE */
#define IFX_CIF_LDS_CTRL_LDS_V_MODE_OFF (4u)

/** \brief  Length for Ifx_CIF_LDS_FAC_Bits.LDS_H_FAC */
#define IFX_CIF_LDS_FAC_LDS_H_FAC_LEN (8u)

/** \brief  Mask for Ifx_CIF_LDS_FAC_Bits.LDS_H_FAC */
#define IFX_CIF_LDS_FAC_LDS_H_FAC_MSK (0xffu)

/** \brief  Offset for Ifx_CIF_LDS_FAC_Bits.LDS_H_FAC */
#define IFX_CIF_LDS_FAC_LDS_H_FAC_OFF (16u)

/** \brief  Length for Ifx_CIF_LDS_FAC_Bits.LDS_V_FAC */
#define IFX_CIF_LDS_FAC_LDS_V_FAC_LEN (8u)

/** \brief  Mask for Ifx_CIF_LDS_FAC_Bits.LDS_V_FAC */
#define IFX_CIF_LDS_FAC_LDS_V_FAC_MSK (0xffu)

/** \brief  Offset for Ifx_CIF_LDS_FAC_Bits.LDS_V_FAC */
#define IFX_CIF_LDS_FAC_LDS_V_FAC_OFF (0u)

/** \brief  Length for Ifx_CIF_MI_BYTE_CNT_Bits.BYTE_CNT */
#define IFX_CIF_MI_BYTE_CNT_BYTE_CNT_LEN (24u)

/** \brief  Mask for Ifx_CIF_MI_BYTE_CNT_Bits.BYTE_CNT */
#define IFX_CIF_MI_BYTE_CNT_BYTE_CNT_MSK (0xffffffu)

/** \brief  Offset for Ifx_CIF_MI_BYTE_CNT_Bits.BYTE_CNT */
#define IFX_CIF_MI_BYTE_CNT_BYTE_CNT_OFF (0u)

/** \brief  Length for Ifx_CIF_MI_CTRL_Bits.BURST_LEN_CHROM */
#define IFX_CIF_MI_CTRL_BURST_LEN_CHROM_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_CTRL_Bits.BURST_LEN_CHROM */
#define IFX_CIF_MI_CTRL_BURST_LEN_CHROM_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_CTRL_Bits.BURST_LEN_CHROM */
#define IFX_CIF_MI_CTRL_BURST_LEN_CHROM_OFF (18u)

/** \brief  Length for Ifx_CIF_MI_CTRL_Bits.BURST_LEN_LUM */
#define IFX_CIF_MI_CTRL_BURST_LEN_LUM_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_CTRL_Bits.BURST_LEN_LUM */
#define IFX_CIF_MI_CTRL_BURST_LEN_LUM_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_CTRL_Bits.BURST_LEN_LUM */
#define IFX_CIF_MI_CTRL_BURST_LEN_LUM_OFF (16u)

/** \brief  Length for Ifx_CIF_MI_CTRL_Bits.BYTE_SWAP */
#define IFX_CIF_MI_CTRL_BYTE_SWAP_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_CTRL_Bits.BYTE_SWAP */
#define IFX_CIF_MI_CTRL_BYTE_SWAP_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_CTRL_Bits.BYTE_SWAP */
#define IFX_CIF_MI_CTRL_BYTE_SWAP_OFF (7u)

/** \brief  Length for Ifx_CIF_MI_CTRL_Bits.INIT_BASE_EN */
#define IFX_CIF_MI_CTRL_INIT_BASE_EN_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_CTRL_Bits.INIT_BASE_EN */
#define IFX_CIF_MI_CTRL_INIT_BASE_EN_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_CTRL_Bits.INIT_BASE_EN */
#define IFX_CIF_MI_CTRL_INIT_BASE_EN_OFF (20u)

/** \brief  Length for Ifx_CIF_MI_CTRL_Bits.INIT_OFFSET_EN */
#define IFX_CIF_MI_CTRL_INIT_OFFSET_EN_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_CTRL_Bits.INIT_OFFSET_EN */
#define IFX_CIF_MI_CTRL_INIT_OFFSET_EN_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_CTRL_Bits.INIT_OFFSET_EN */
#define IFX_CIF_MI_CTRL_INIT_OFFSET_EN_OFF (21u)

/** \brief  Length for Ifx_CIF_MI_CTRL_Bits.JPEG_ENABLE */
#define IFX_CIF_MI_CTRL_JPEG_ENABLE_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_CTRL_Bits.JPEG_ENABLE */
#define IFX_CIF_MI_CTRL_JPEG_ENABLE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_CTRL_Bits.JPEG_ENABLE */
#define IFX_CIF_MI_CTRL_JPEG_ENABLE_OFF (2u)

/** \brief  Length for Ifx_CIF_MI_CTRL_Bits.MP_ENABLE */
#define IFX_CIF_MI_CTRL_MP_ENABLE_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_CTRL_Bits.MP_ENABLE */
#define IFX_CIF_MI_CTRL_MP_ENABLE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_CTRL_Bits.MP_ENABLE */
#define IFX_CIF_MI_CTRL_MP_ENABLE_OFF (0u)

/** \brief  Length for Ifx_CIF_MI_CTRL_Bits.MP_WRITE_FORMAT */
#define IFX_CIF_MI_CTRL_MP_WRITE_FORMAT_LEN (2u)

/** \brief  Mask for Ifx_CIF_MI_CTRL_Bits.MP_WRITE_FORMAT */
#define IFX_CIF_MI_CTRL_MP_WRITE_FORMAT_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_MI_CTRL_Bits.MP_WRITE_FORMAT */
#define IFX_CIF_MI_CTRL_MP_WRITE_FORMAT_OFF (22u)

/** \brief  Length for Ifx_CIF_MI_CTRL_Bits.RAW_ENABLE */
#define IFX_CIF_MI_CTRL_RAW_ENABLE_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_CTRL_Bits.RAW_ENABLE */
#define IFX_CIF_MI_CTRL_RAW_ENABLE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_CTRL_Bits.RAW_ENABLE */
#define IFX_CIF_MI_CTRL_RAW_ENABLE_OFF (3u)

/** \brief  Length for Ifx_CIF_MI_CTRL_SHD_Bits.JPEG_ENABLE_IN */
#define IFX_CIF_MI_CTRL_SHD_JPEG_ENABLE_IN_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_CTRL_SHD_Bits.JPEG_ENABLE_IN */
#define IFX_CIF_MI_CTRL_SHD_JPEG_ENABLE_IN_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_CTRL_SHD_Bits.JPEG_ENABLE_IN */
#define IFX_CIF_MI_CTRL_SHD_JPEG_ENABLE_IN_OFF (4u)

/** \brief  Length for Ifx_CIF_MI_CTRL_SHD_Bits.JPEG_ENABLE_OUT */
#define IFX_CIF_MI_CTRL_SHD_JPEG_ENABLE_OUT_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_CTRL_SHD_Bits.JPEG_ENABLE_OUT */
#define IFX_CIF_MI_CTRL_SHD_JPEG_ENABLE_OUT_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_CTRL_SHD_Bits.JPEG_ENABLE_OUT */
#define IFX_CIF_MI_CTRL_SHD_JPEG_ENABLE_OUT_OFF (18u)

/** \brief  Length for Ifx_CIF_MI_CTRL_SHD_Bits.MP_ENABLE_IN */
#define IFX_CIF_MI_CTRL_SHD_MP_ENABLE_IN_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_CTRL_SHD_Bits.MP_ENABLE_IN */
#define IFX_CIF_MI_CTRL_SHD_MP_ENABLE_IN_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_CTRL_SHD_Bits.MP_ENABLE_IN */
#define IFX_CIF_MI_CTRL_SHD_MP_ENABLE_IN_OFF (0u)

