lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_bf.h
/** \brief  Length for Ifx_CIF_MI_CTRL_SHD_Bits.MP_ENABLE_OUT */
#define IFX_CIF_MI_CTRL_SHD_MP_ENABLE_OUT_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_CTRL_SHD_Bits.MP_ENABLE_OUT */
#define IFX_CIF_MI_CTRL_SHD_MP_ENABLE_OUT_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_CTRL_SHD_Bits.MP_ENABLE_OUT */
#define IFX_CIF_MI_CTRL_SHD_MP_ENABLE_OUT_OFF (16u)

/** \brief  Length for Ifx_CIF_MI_CTRL_SHD_Bits.RAW_ENABLE_IN */
#define IFX_CIF_MI_CTRL_SHD_RAW_ENABLE_IN_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_CTRL_SHD_Bits.RAW_ENABLE_IN */
#define IFX_CIF_MI_CTRL_SHD_RAW_ENABLE_IN_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_CTRL_SHD_Bits.RAW_ENABLE_IN */
#define IFX_CIF_MI_CTRL_SHD_RAW_ENABLE_IN_OFF (5u)

/** \brief  Length for Ifx_CIF_MI_CTRL_SHD_Bits.RAW_ENABLE_OUT */
#define IFX_CIF_MI_CTRL_SHD_RAW_ENABLE_OUT_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_CTRL_SHD_Bits.RAW_ENABLE_OUT */
#define IFX_CIF_MI_CTRL_SHD_RAW_ENABLE_OUT_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_CTRL_SHD_Bits.RAW_ENABLE_OUT */
#define IFX_CIF_MI_CTRL_SHD_RAW_ENABLE_OUT_OFF (19u)

/** \brief  Length for Ifx_CIF_MI_ICR_Bits.BUS_ERROR */
#define IFX_CIF_MI_ICR_BUS_ERROR_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_ICR_Bits.BUS_ERROR */
#define IFX_CIF_MI_ICR_BUS_ERROR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_ICR_Bits.BUS_ERROR */
#define IFX_CIF_MI_ICR_BUS_ERROR_OFF (10u)

/** \brief  Length for Ifx_CIF_MI_ICR_Bits.FILL_MPY */
#define IFX_CIF_MI_ICR_FILL_MPY_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_ICR_Bits.FILL_MPY */
#define IFX_CIF_MI_ICR_FILL_MPY_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_ICR_Bits.FILL_MPY */
#define IFX_CIF_MI_ICR_FILL_MPY_OFF (3u)

/** \brief  Length for Ifx_CIF_MI_ICR_Bits.MBLK_LINE */
#define IFX_CIF_MI_ICR_MBLK_LINE_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_ICR_Bits.MBLK_LINE */
#define IFX_CIF_MI_ICR_MBLK_LINE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_ICR_Bits.MBLK_LINE */
#define IFX_CIF_MI_ICR_MBLK_LINE_OFF (2u)

/** \brief  Length for Ifx_CIF_MI_ICR_Bits.MP_FRAME_END */
#define IFX_CIF_MI_ICR_MP_FRAME_END_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_ICR_Bits.MP_FRAME_END */
#define IFX_CIF_MI_ICR_MP_FRAME_END_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_ICR_Bits.MP_FRAME_END */
#define IFX_CIF_MI_ICR_MP_FRAME_END_OFF (0u)

/** \brief  Length for Ifx_CIF_MI_ICR_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_ICR_WRAP_MP_CB_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_ICR_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_ICR_WRAP_MP_CB_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_ICR_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_ICR_WRAP_MP_CB_OFF (5u)

/** \brief  Length for Ifx_CIF_MI_ICR_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_ICR_WRAP_MP_CR_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_ICR_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_ICR_WRAP_MP_CR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_ICR_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_ICR_WRAP_MP_CR_OFF (6u)

/** \brief  Length for Ifx_CIF_MI_ICR_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_ICR_WRAP_MP_Y_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_ICR_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_ICR_WRAP_MP_Y_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_ICR_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_ICR_WRAP_MP_Y_OFF (4u)

/** \brief  Length for Ifx_CIF_MI_IMSC_Bits.BUS_ERROR */
#define IFX_CIF_MI_IMSC_BUS_ERROR_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_IMSC_Bits.BUS_ERROR */
#define IFX_CIF_MI_IMSC_BUS_ERROR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_IMSC_Bits.BUS_ERROR */
#define IFX_CIF_MI_IMSC_BUS_ERROR_OFF (10u)

/** \brief  Length for Ifx_CIF_MI_IMSC_Bits.FILL_MP_Y */
#define IFX_CIF_MI_IMSC_FILL_MP_Y_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_IMSC_Bits.FILL_MP_Y */
#define IFX_CIF_MI_IMSC_FILL_MP_Y_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_IMSC_Bits.FILL_MP_Y */
#define IFX_CIF_MI_IMSC_FILL_MP_Y_OFF (3u)

/** \brief  Length for Ifx_CIF_MI_IMSC_Bits.MBLK_LINE */
#define IFX_CIF_MI_IMSC_MBLK_LINE_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_IMSC_Bits.MBLK_LINE */
#define IFX_CIF_MI_IMSC_MBLK_LINE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_IMSC_Bits.MBLK_LINE */
#define IFX_CIF_MI_IMSC_MBLK_LINE_OFF (2u)

/** \brief  Length for Ifx_CIF_MI_IMSC_Bits.MP_FRAME_END */
#define IFX_CIF_MI_IMSC_MP_FRAME_END_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_IMSC_Bits.MP_FRAME_END */
#define IFX_CIF_MI_IMSC_MP_FRAME_END_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_IMSC_Bits.MP_FRAME_END */
#define IFX_CIF_MI_IMSC_MP_FRAME_END_OFF (0u)

/** \brief  Length for Ifx_CIF_MI_IMSC_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_IMSC_WRAP_MP_CB_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_IMSC_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_IMSC_WRAP_MP_CB_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_IMSC_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_IMSC_WRAP_MP_CB_OFF (5u)

/** \brief  Length for Ifx_CIF_MI_IMSC_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_IMSC_WRAP_MP_CR_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_IMSC_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_IMSC_WRAP_MP_CR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_IMSC_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_IMSC_WRAP_MP_CR_OFF (6u)

/** \brief  Length for Ifx_CIF_MI_IMSC_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_IMSC_WRAP_MP_Y_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_IMSC_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_IMSC_WRAP_MP_Y_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_IMSC_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_IMSC_WRAP_MP_Y_OFF (4u)

/** \brief  Length for Ifx_CIF_MI_INIT_Bits.MI_CFG_UPD */
#define IFX_CIF_MI_INIT_MI_CFG_UPD_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_INIT_Bits.MI_CFG_UPD */
#define IFX_CIF_MI_INIT_MI_CFG_UPD_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_INIT_Bits.MI_CFG_UPD */
#define IFX_CIF_MI_INIT_MI_CFG_UPD_OFF (4u)

/** \brief  Length for Ifx_CIF_MI_INIT_Bits.MI_SKIP */
#define IFX_CIF_MI_INIT_MI_SKIP_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_INIT_Bits.MI_SKIP */
#define IFX_CIF_MI_INIT_MI_SKIP_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_INIT_Bits.MI_SKIP */
#define IFX_CIF_MI_INIT_MI_SKIP_OFF (2u)

/** \brief  Length for Ifx_CIF_MI_ISR_Bits.Bus_ERROR */
#define IFX_CIF_MI_ISR_BUS_ERROR_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_ISR_Bits.Bus_ERROR */
#define IFX_CIF_MI_ISR_BUS_ERROR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_ISR_Bits.Bus_ERROR */
#define IFX_CIF_MI_ISR_BUS_ERROR_OFF (10u)

/** \brief  Length for Ifx_CIF_MI_ISR_Bits.FILL_MP_Y */
#define IFX_CIF_MI_ISR_FILL_MP_Y_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_ISR_Bits.FILL_MP_Y */
#define IFX_CIF_MI_ISR_FILL_MP_Y_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_ISR_Bits.FILL_MP_Y */
#define IFX_CIF_MI_ISR_FILL_MP_Y_OFF (3u)

/** \brief  Length for Ifx_CIF_MI_ISR_Bits.MBLK_LINE */
#define IFX_CIF_MI_ISR_MBLK_LINE_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_ISR_Bits.MBLK_LINE */
#define IFX_CIF_MI_ISR_MBLK_LINE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_ISR_Bits.MBLK_LINE */
#define IFX_CIF_MI_ISR_MBLK_LINE_OFF (2u)

