lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_bf.h
/** \brief  Length for Ifx_CIF_MI_MP_CR_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_SIZE_SHD_FIXED_TO_00_LEN (2u)

/** \brief  Mask for Ifx_CIF_MI_MP_CR_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_SIZE_SHD_FIXED_TO_00_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_MI_MP_CR_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_CR_SIZE_SHD_FIXED_TO_00_OFF (0u)

/** \brief  Length for Ifx_CIF_MI_MP_CR_SIZE_SHD_Bits.MP_CR_SIZE */
#define IFX_CIF_MI_MP_CR_SIZE_SHD_MP_CR_SIZE_LEN (22u)

/** \brief  Mask for Ifx_CIF_MI_MP_CR_SIZE_SHD_Bits.MP_CR_SIZE */
#define IFX_CIF_MI_MP_CR_SIZE_SHD_MP_CR_SIZE_MSK (0x3fffffu)

/** \brief  Offset for Ifx_CIF_MI_MP_CR_SIZE_SHD_Bits.MP_CR_SIZE */
#define IFX_CIF_MI_MP_CR_SIZE_SHD_MP_CR_SIZE_OFF (2u)

/** \brief  Length for Ifx_CIF_MI_MP_Y_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_BASE_AD_INIT_FIXED_TO_00_LEN (2u)

/** \brief  Mask for Ifx_CIF_MI_MP_Y_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_BASE_AD_INIT_FIXED_TO_00_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_MI_MP_Y_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_BASE_AD_INIT_FIXED_TO_00_OFF (0u)

/** \brief  Length for Ifx_CIF_MI_MP_Y_BASE_AD_INIT_Bits.MP_Y_BASE_AD_INIT */
#define IFX_CIF_MI_MP_Y_BASE_AD_INIT_MP_Y_BASE_AD_INIT_LEN (30u)

/** \brief  Mask for Ifx_CIF_MI_MP_Y_BASE_AD_INIT_Bits.MP_Y_BASE_AD_INIT */
#define IFX_CIF_MI_MP_Y_BASE_AD_INIT_MP_Y_BASE_AD_INIT_MSK (0x3fffffffu)

/** \brief  Offset for Ifx_CIF_MI_MP_Y_BASE_AD_INIT_Bits.MP_Y_BASE_AD_INIT */
#define IFX_CIF_MI_MP_Y_BASE_AD_INIT_MP_Y_BASE_AD_INIT_OFF (2u)

/** \brief  Length for Ifx_CIF_MI_MP_Y_BASE_AD_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_BASE_AD_SHD_FIXED_TO_00_LEN (2u)

/** \brief  Mask for Ifx_CIF_MI_MP_Y_BASE_AD_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_BASE_AD_SHD_FIXED_TO_00_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_MI_MP_Y_BASE_AD_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_BASE_AD_SHD_FIXED_TO_00_OFF (0u)

/** \brief  Length for Ifx_CIF_MI_MP_Y_BASE_AD_SHD_Bits.MP_Y_BASE_AD */
#define IFX_CIF_MI_MP_Y_BASE_AD_SHD_MP_Y_BASE_AD_LEN (30u)

/** \brief  Mask for Ifx_CIF_MI_MP_Y_BASE_AD_SHD_Bits.MP_Y_BASE_AD */
#define IFX_CIF_MI_MP_Y_BASE_AD_SHD_MP_Y_BASE_AD_MSK (0x3fffffffu)

/** \brief  Offset for Ifx_CIF_MI_MP_Y_BASE_AD_SHD_Bits.MP_Y_BASE_AD */
#define IFX_CIF_MI_MP_Y_BASE_AD_SHD_MP_Y_BASE_AD_OFF (2u)

/** \brief  Length for Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_INIT_FIXED_TO_00_LEN (2u)

/** \brief  Mask for Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_INIT_FIXED_TO_00_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_INIT_FIXED_TO_00_OFF (0u)

/** \brief  Length for Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT_Bits.MP_Y_IRQ_OFFS_INIT */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_INIT_MP_Y_IRQ_OFFS_INIT_LEN (22u)

/** \brief  Mask for Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT_Bits.MP_Y_IRQ_OFFS_INIT */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_INIT_MP_Y_IRQ_OFFS_INIT_MSK (0x3fffffu)

/** \brief  Offset for Ifx_CIF_MI_MP_Y_IRQ_OFFS_INIT_Bits.MP_Y_IRQ_OFFS_INIT */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_INIT_MP_Y_IRQ_OFFS_INIT_OFF (2u)

/** \brief  Length for Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_SHD_FIXED_TO_00_LEN (2u)

/** \brief  Mask for Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_SHD_FIXED_TO_00_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_SHD_FIXED_TO_00_OFF (0u)

/** \brief  Length for Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD_Bits.MP_Y_IRQ_OFFS */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_SHD_MP_Y_IRQ_OFFS_LEN (22u)

/** \brief  Mask for Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD_Bits.MP_Y_IRQ_OFFS */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_SHD_MP_Y_IRQ_OFFS_MSK (0x3fffffu)

/** \brief  Offset for Ifx_CIF_MI_MP_Y_IRQ_OFFS_SHD_Bits.MP_Y_IRQ_OFFS */
#define IFX_CIF_MI_MP_Y_IRQ_OFFS_SHD_MP_Y_IRQ_OFFS_OFF (2u)

/** \brief  Length for Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_INIT_FIXED_TO_00_LEN (2u)

/** \brief  Mask for Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_INIT_FIXED_TO_00_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_INIT_FIXED_TO_00_OFF (0u)

/** \brief  Length for Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits.MP_Y_OFFS_CNT_INIT */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_INIT_MP_Y_OFFS_CNT_INIT_LEN (22u)

/** \brief  Mask for Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits.MP_Y_OFFS_CNT_INIT */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_INIT_MP_Y_OFFS_CNT_INIT_MSK (0x3fffffu)

/** \brief  Offset for Ifx_CIF_MI_MP_Y_OFFS_CNT_INIT_Bits.MP_Y_OFFS_CNT_INIT */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_INIT_MP_Y_OFFS_CNT_INIT_OFF (2u)

/** \brief  Length for Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_SHD_FIXED_TO_00_LEN (2u)

/** \brief  Mask for Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_SHD_FIXED_TO_00_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_SHD_FIXED_TO_00_OFF (0u)

/** \brief  Length for Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD_Bits.MP_Y_OFFS_CNT */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_SHD_MP_Y_OFFS_CNT_LEN (22u)

/** \brief  Mask for Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD_Bits.MP_Y_OFFS_CNT */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_SHD_MP_Y_OFFS_CNT_MSK (0x3fffffu)

/** \brief  Offset for Ifx_CIF_MI_MP_Y_OFFS_CNT_SHD_Bits.MP_Y_OFFS_CNT */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_SHD_MP_Y_OFFS_CNT_OFF (2u)

/** \brief  Length for Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_START_FIXED_TO_00_LEN (2u)

/** \brief  Mask for Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_START_FIXED_TO_00_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_START_FIXED_TO_00_OFF (0u)

/** \brief  Length for Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits.MP_Y_OFFS_CNT_START */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_START_MP_Y_OFFS_CNT_START_LEN (22u)

/** \brief  Mask for Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits.MP_Y_OFFS_CNT_START */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_START_MP_Y_OFFS_CNT_START_MSK (0x3fffffu)

