lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_bf.h
/** \brief  Offset for Ifx_CIF_MI_MP_Y_OFFS_CNT_START_Bits.MP_Y_OFFS_CNT_START */
#define IFX_CIF_MI_MP_Y_OFFS_CNT_START_MP_Y_OFFS_CNT_START_OFF (2u)

/** \brief  Length for Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_SIZE_INIT_FIXED_TO_00_LEN (2u)

/** \brief  Mask for Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_SIZE_INIT_FIXED_TO_00_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_SIZE_INIT_FIXED_TO_00_OFF (0u)

/** \brief  Length for Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits.MP_Y_SIZE_INIT */
#define IFX_CIF_MI_MP_Y_SIZE_INIT_MP_Y_SIZE_INIT_LEN (22u)

/** \brief  Mask for Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits.MP_Y_SIZE_INIT */
#define IFX_CIF_MI_MP_Y_SIZE_INIT_MP_Y_SIZE_INIT_MSK (0x3fffffu)

/** \brief  Offset for Ifx_CIF_MI_MP_Y_SIZE_INIT_Bits.MP_Y_SIZE_INIT */
#define IFX_CIF_MI_MP_Y_SIZE_INIT_MP_Y_SIZE_INIT_OFF (2u)

/** \brief  Length for Ifx_CIF_MI_MP_Y_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_SIZE_SHD_FIXED_TO_00_LEN (2u)

/** \brief  Mask for Ifx_CIF_MI_MP_Y_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_SIZE_SHD_FIXED_TO_00_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_MI_MP_Y_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MI_MP_Y_SIZE_SHD_FIXED_TO_00_OFF (0u)

/** \brief  Length for Ifx_CIF_MI_MP_Y_SIZE_SHD_Bits.MP_Y_SIZE */
#define IFX_CIF_MI_MP_Y_SIZE_SHD_MP_Y_SIZE_LEN (22u)

/** \brief  Mask for Ifx_CIF_MI_MP_Y_SIZE_SHD_Bits.MP_Y_SIZE */
#define IFX_CIF_MI_MP_Y_SIZE_SHD_MP_Y_SIZE_MSK (0x3fffffu)

/** \brief  Offset for Ifx_CIF_MI_MP_Y_SIZE_SHD_Bits.MP_Y_SIZE */
#define IFX_CIF_MI_MP_Y_SIZE_SHD_MP_Y_SIZE_OFF (2u)

/** \brief  Length for Ifx_CIF_MI_RIS_Bits.BUS_ERROR */
#define IFX_CIF_MI_RIS_BUS_ERROR_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_RIS_Bits.BUS_ERROR */
#define IFX_CIF_MI_RIS_BUS_ERROR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_RIS_Bits.BUS_ERROR */
#define IFX_CIF_MI_RIS_BUS_ERROR_OFF (10u)

/** \brief  Length for Ifx_CIF_MI_RIS_Bits.FILL_MP_Y */
#define IFX_CIF_MI_RIS_FILL_MP_Y_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_RIS_Bits.FILL_MP_Y */
#define IFX_CIF_MI_RIS_FILL_MP_Y_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_RIS_Bits.FILL_MP_Y */
#define IFX_CIF_MI_RIS_FILL_MP_Y_OFF (3u)

/** \brief  Length for Ifx_CIF_MI_RIS_Bits.MBLK_LINE */
#define IFX_CIF_MI_RIS_MBLK_LINE_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_RIS_Bits.MBLK_LINE */
#define IFX_CIF_MI_RIS_MBLK_LINE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_RIS_Bits.MBLK_LINE */
#define IFX_CIF_MI_RIS_MBLK_LINE_OFF (2u)

/** \brief  Length for Ifx_CIF_MI_RIS_Bits.MP_FRAME_END */
#define IFX_CIF_MI_RIS_MP_FRAME_END_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_RIS_Bits.MP_FRAME_END */
#define IFX_CIF_MI_RIS_MP_FRAME_END_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_RIS_Bits.MP_FRAME_END */
#define IFX_CIF_MI_RIS_MP_FRAME_END_OFF (0u)

/** \brief  Length for Ifx_CIF_MI_RIS_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_RIS_WRAP_MP_CB_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_RIS_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_RIS_WRAP_MP_CB_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_RIS_Bits.WRAP_MP_CB */
#define IFX_CIF_MI_RIS_WRAP_MP_CB_OFF (5u)

/** \brief  Length for Ifx_CIF_MI_RIS_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_RIS_WRAP_MP_CR_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_RIS_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_RIS_WRAP_MP_CR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_RIS_Bits.WRAP_MP_CR */
#define IFX_CIF_MI_RIS_WRAP_MP_CR_OFF (6u)

/** \brief  Length for Ifx_CIF_MI_RIS_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_RIS_WRAP_MP_Y_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_RIS_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_RIS_WRAP_MP_Y_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_RIS_Bits.WRAP_MP_Y */
#define IFX_CIF_MI_RIS_WRAP_MP_Y_OFF (4u)

/** \brief  Length for Ifx_CIF_MI_STATUS_Bits.BUS_WRITE_ERROR */
#define IFX_CIF_MI_STATUS_BUS_WRITE_ERROR_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_STATUS_Bits.BUS_WRITE_ERROR */
#define IFX_CIF_MI_STATUS_BUS_WRITE_ERROR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_STATUS_Bits.BUS_WRITE_ERROR */
#define IFX_CIF_MI_STATUS_BUS_WRITE_ERROR_OFF (8u)

/** \brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.BUS_WRITE_ERROR */
#define IFX_CIF_MI_STATUS_CLR_BUS_WRITE_ERROR_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.BUS_WRITE_ERROR */
#define IFX_CIF_MI_STATUS_CLR_BUS_WRITE_ERROR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.BUS_WRITE_ERROR */
#define IFX_CIF_MI_STATUS_CLR_BUS_WRITE_ERROR_OFF (8u)

/** \brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.EP_1_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_1_FIFO_FULL_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.EP_1_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_1_FIFO_FULL_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.EP_1_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_1_FIFO_FULL_OFF (24u)

/** \brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.EP_2_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_2_FIFO_FULL_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.EP_2_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_2_FIFO_FULL_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.EP_2_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_2_FIFO_FULL_OFF (25u)

/** \brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.EP_3_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_3_FIFO_FULL_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.EP_3_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_3_FIFO_FULL_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.EP_3_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_3_FIFO_FULL_OFF (26u)

/** \brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.EP_4_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_4_FIFO_FULL_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.EP_4_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_4_FIFO_FULL_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.EP_4_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_4_FIFO_FULL_OFF (27u)

/** \brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.EP_5_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_5_FIFO_FULL_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.EP_5_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_5_FIFO_FULL_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.EP_5_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_EP_5_FIFO_FULL_OFF (28u)

/** \brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.MP_CB_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_CB_FIFO_FULL_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.MP_CB_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_CB_FIFO_FULL_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.MP_CB_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_CB_FIFO_FULL_OFF (1u)

/** \brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.MP_CR_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_CR_FIFO_FULL_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.MP_CR_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_CR_FIFO_FULL_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.MP_CR_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_CR_FIFO_FULL_OFF (2u)

