lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_bf.h
/** \brief  Length for Ifx_CIF_MI_STATUS_CLR_Bits.MP_Y_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_Y_FIFO_FULL_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_STATUS_CLR_Bits.MP_Y_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_Y_FIFO_FULL_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_STATUS_CLR_Bits.MP_Y_FIFO_FULL */
#define IFX_CIF_MI_STATUS_CLR_MP_Y_FIFO_FULL_OFF (0u)

/** \brief  Length for Ifx_CIF_MI_STATUS_Bits.MP_CB_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_CB_FIFO_FULL_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_STATUS_Bits.MP_CB_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_CB_FIFO_FULL_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_STATUS_Bits.MP_CB_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_CB_FIFO_FULL_OFF (1u)

/** \brief  Length for Ifx_CIF_MI_STATUS_Bits.MP_CR_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_CR_FIFO_FULL_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_STATUS_Bits.MP_CR_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_CR_FIFO_FULL_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_STATUS_Bits.MP_CR_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_CR_FIFO_FULL_OFF (2u)

/** \brief  Length for Ifx_CIF_MI_STATUS_Bits.MP_Y_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_Y_FIFO_FULL_LEN (1u)

/** \brief  Mask for Ifx_CIF_MI_STATUS_Bits.MP_Y_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_Y_FIFO_FULL_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MI_STATUS_Bits.MP_Y_FIFO_FULL */
#define IFX_CIF_MI_STATUS_MP_Y_FIFO_FULL_OFF (0u)

/** \brief  Length for Ifx_CIF_MIEP_CH_BASE_AD_INIT_Bits.EP_BASE_AD_INIT */
#define IFX_CIF_MIEP_CH_BASE_AD_INIT_EP_BASE_AD_INIT_LEN (30u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_BASE_AD_INIT_Bits.EP_BASE_AD_INIT */
#define IFX_CIF_MIEP_CH_BASE_AD_INIT_EP_BASE_AD_INIT_MSK (0x3fffffffu)

/** \brief  Offset for Ifx_CIF_MIEP_CH_BASE_AD_INIT_Bits.EP_BASE_AD_INIT */
#define IFX_CIF_MIEP_CH_BASE_AD_INIT_EP_BASE_AD_INIT_OFF (2u)

/** \brief  Length for Ifx_CIF_MIEP_CH_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_BASE_AD_INIT_FIXED_TO_00_LEN (2u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_BASE_AD_INIT_FIXED_TO_00_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_MIEP_CH_BASE_AD_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_BASE_AD_INIT_FIXED_TO_00_OFF (0u)

/** \brief  Length for Ifx_CIF_MIEP_CH_BASE_AD_SHD_Bits.EP_BASE_AD */
#define IFX_CIF_MIEP_CH_BASE_AD_SHD_EP_BASE_AD_LEN (30u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_BASE_AD_SHD_Bits.EP_BASE_AD */
#define IFX_CIF_MIEP_CH_BASE_AD_SHD_EP_BASE_AD_MSK (0x3fffffffu)

/** \brief  Offset for Ifx_CIF_MIEP_CH_BASE_AD_SHD_Bits.EP_BASE_AD */
#define IFX_CIF_MIEP_CH_BASE_AD_SHD_EP_BASE_AD_OFF (2u)

/** \brief  Length for Ifx_CIF_MIEP_CH_BASE_AD_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_BASE_AD_SHD_FIXED_TO_00_LEN (2u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_BASE_AD_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_BASE_AD_SHD_FIXED_TO_00_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_MIEP_CH_BASE_AD_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_BASE_AD_SHD_FIXED_TO_00_OFF (0u)

/** \brief  Length for Ifx_CIF_MIEP_CH_CTRL_Bits.BYTE_SWAP */
#define IFX_CIF_MIEP_CH_CTRL_BYTE_SWAP_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_CTRL_Bits.BYTE_SWAP */
#define IFX_CIF_MIEP_CH_CTRL_BYTE_SWAP_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_CH_CTRL_Bits.BYTE_SWAP */
#define IFX_CIF_MIEP_CH_CTRL_BYTE_SWAP_OFF (7u)

/** \brief  Length for Ifx_CIF_MIEP_CH_CTRL_Bits.EP_ENABLE */
#define IFX_CIF_MIEP_CH_CTRL_EP_ENABLE_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_CTRL_Bits.EP_ENABLE */
#define IFX_CIF_MIEP_CH_CTRL_EP_ENABLE_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_CH_CTRL_Bits.EP_ENABLE */
#define IFX_CIF_MIEP_CH_CTRL_EP_ENABLE_OFF (0u)

/** \brief  Length for Ifx_CIF_MIEP_CH_CTRL_Bits.EP_WRITE_FORMAT */
#define IFX_CIF_MIEP_CH_CTRL_EP_WRITE_FORMAT_LEN (2u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_CTRL_Bits.EP_WRITE_FORMAT */
#define IFX_CIF_MIEP_CH_CTRL_EP_WRITE_FORMAT_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_MIEP_CH_CTRL_Bits.EP_WRITE_FORMAT */
#define IFX_CIF_MIEP_CH_CTRL_EP_WRITE_FORMAT_OFF (22u)

/** \brief  Length for Ifx_CIF_MIEP_CH_CTRL_Bits.INIT_BASE_EN */
#define IFX_CIF_MIEP_CH_CTRL_INIT_BASE_EN_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_CTRL_Bits.INIT_BASE_EN */
#define IFX_CIF_MIEP_CH_CTRL_INIT_BASE_EN_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_CH_CTRL_Bits.INIT_BASE_EN */
#define IFX_CIF_MIEP_CH_CTRL_INIT_BASE_EN_OFF (20u)

/** \brief  Length for Ifx_CIF_MIEP_CH_CTRL_Bits.INIT_OFFSET_EN */
#define IFX_CIF_MIEP_CH_CTRL_INIT_OFFSET_EN_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_CTRL_Bits.INIT_OFFSET_EN */
#define IFX_CIF_MIEP_CH_CTRL_INIT_OFFSET_EN_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_CH_CTRL_Bits.INIT_OFFSET_EN */
#define IFX_CIF_MIEP_CH_CTRL_INIT_OFFSET_EN_OFF (21u)

/** \brief  Length for Ifx_CIF_MIEP_CH_CTRL_SHD_Bits.EP_ENABLE_IN */
#define IFX_CIF_MIEP_CH_CTRL_SHD_EP_ENABLE_IN_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_CTRL_SHD_Bits.EP_ENABLE_IN */
#define IFX_CIF_MIEP_CH_CTRL_SHD_EP_ENABLE_IN_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_CH_CTRL_SHD_Bits.EP_ENABLE_IN */
#define IFX_CIF_MIEP_CH_CTRL_SHD_EP_ENABLE_IN_OFF (0u)

/** \brief  Length for Ifx_CIF_MIEP_CH_CTRL_SHD_Bits.EP_ENABLE_OUT */
#define IFX_CIF_MIEP_CH_CTRL_SHD_EP_ENABLE_OUT_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_CTRL_SHD_Bits.EP_ENABLE_OUT */
#define IFX_CIF_MIEP_CH_CTRL_SHD_EP_ENABLE_OUT_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_CH_CTRL_SHD_Bits.EP_ENABLE_OUT */
#define IFX_CIF_MIEP_CH_CTRL_SHD_EP_ENABLE_OUT_OFF (16u)

/** \brief  Length for Ifx_CIF_MIEP_CH_INIT_Bits.MI_EP_CFG_UPD */
#define IFX_CIF_MIEP_CH_INIT_MI_EP_CFG_UPD_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_INIT_Bits.MI_EP_CFG_UPD */
#define IFX_CIF_MIEP_CH_INIT_MI_EP_CFG_UPD_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_CH_INIT_Bits.MI_EP_CFG_UPD */
#define IFX_CIF_MIEP_CH_INIT_MI_EP_CFG_UPD_OFF (4u)

/** \brief  Length for Ifx_CIF_MIEP_CH_INIT_Bits.MI_EP_SKIP */
#define IFX_CIF_MIEP_CH_INIT_MI_EP_SKIP_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_INIT_Bits.MI_EP_SKIP */
#define IFX_CIF_MIEP_CH_INIT_MI_EP_SKIP_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_CH_INIT_Bits.MI_EP_SKIP */
#define IFX_CIF_MIEP_CH_INIT_MI_EP_SKIP_OFF (2u)

