lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_bf.h
/** \brief  Length for Ifx_CIF_MIEP_CH_IRQ_OFFS_INIT_Bits.EP_IRQ_OFFS_INIT */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_INIT_EP_IRQ_OFFS_INIT_LEN (22u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_IRQ_OFFS_INIT_Bits.EP_IRQ_OFFS_INIT */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_INIT_EP_IRQ_OFFS_INIT_MSK (0x3fffffu)

/** \brief  Offset for Ifx_CIF_MIEP_CH_IRQ_OFFS_INIT_Bits.EP_IRQ_OFFS_INIT */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_INIT_EP_IRQ_OFFS_INIT_OFF (2u)

/** \brief  Length for Ifx_CIF_MIEP_CH_IRQ_OFFS_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_INIT_FIXED_TO_00_LEN (2u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_IRQ_OFFS_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_INIT_FIXED_TO_00_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_MIEP_CH_IRQ_OFFS_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_INIT_FIXED_TO_00_OFF (0u)

/** \brief  Length for Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD_Bits.EP_IRQ_OFFS */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_SHD_EP_IRQ_OFFS_LEN (22u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD_Bits.EP_IRQ_OFFS */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_SHD_EP_IRQ_OFFS_MSK (0x3fffffu)

/** \brief  Offset for Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD_Bits.EP_IRQ_OFFS */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_SHD_EP_IRQ_OFFS_OFF (2u)

/** \brief  Length for Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_SHD_FIXED_TO_00_LEN (2u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_SHD_FIXED_TO_00_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_MIEP_CH_IRQ_OFFS_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_IRQ_OFFS_SHD_FIXED_TO_00_OFF (0u)

/** \brief  Length for Ifx_CIF_MIEP_CH_OFFS_CNT_INIT_Bits.EP_OFFS_CNT_INIT */
#define IFX_CIF_MIEP_CH_OFFS_CNT_INIT_EP_OFFS_CNT_INIT_LEN (22u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_OFFS_CNT_INIT_Bits.EP_OFFS_CNT_INIT */
#define IFX_CIF_MIEP_CH_OFFS_CNT_INIT_EP_OFFS_CNT_INIT_MSK (0x3fffffu)

/** \brief  Offset for Ifx_CIF_MIEP_CH_OFFS_CNT_INIT_Bits.EP_OFFS_CNT_INIT */
#define IFX_CIF_MIEP_CH_OFFS_CNT_INIT_EP_OFFS_CNT_INIT_OFF (2u)

/** \brief  Length for Ifx_CIF_MIEP_CH_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_INIT_FIXED_TO_00_LEN (2u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_INIT_FIXED_TO_00_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_MIEP_CH_OFFS_CNT_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_INIT_FIXED_TO_00_OFF (0u)

/** \brief  Length for Ifx_CIF_MIEP_CH_OFFS_CNT_SHD_Bits.EP_OFFS_CNT */
#define IFX_CIF_MIEP_CH_OFFS_CNT_SHD_EP_OFFS_CNT_LEN (22u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_OFFS_CNT_SHD_Bits.EP_OFFS_CNT */
#define IFX_CIF_MIEP_CH_OFFS_CNT_SHD_EP_OFFS_CNT_MSK (0x3fffffu)

/** \brief  Offset for Ifx_CIF_MIEP_CH_OFFS_CNT_SHD_Bits.EP_OFFS_CNT */
#define IFX_CIF_MIEP_CH_OFFS_CNT_SHD_EP_OFFS_CNT_OFF (2u)

/** \brief  Length for Ifx_CIF_MIEP_CH_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_SHD_FIXED_TO_00_LEN (2u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_SHD_FIXED_TO_00_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_MIEP_CH_OFFS_CNT_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_SHD_FIXED_TO_00_OFF (0u)

/** \brief  Length for Ifx_CIF_MIEP_CH_OFFS_CNT_START_Bits.EP_OFFS_CNT_START */
#define IFX_CIF_MIEP_CH_OFFS_CNT_START_EP_OFFS_CNT_START_LEN (22u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_OFFS_CNT_START_Bits.EP_OFFS_CNT_START */
#define IFX_CIF_MIEP_CH_OFFS_CNT_START_EP_OFFS_CNT_START_MSK (0x3fffffu)

/** \brief  Offset for Ifx_CIF_MIEP_CH_OFFS_CNT_START_Bits.EP_OFFS_CNT_START */
#define IFX_CIF_MIEP_CH_OFFS_CNT_START_EP_OFFS_CNT_START_OFF (2u)

/** \brief  Length for Ifx_CIF_MIEP_CH_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_START_FIXED_TO_00_LEN (2u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_START_FIXED_TO_00_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_MIEP_CH_OFFS_CNT_START_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_OFFS_CNT_START_FIXED_TO_00_OFF (0u)

/** \brief  Length for Ifx_CIF_MIEP_CH_SIZE_INIT_Bits.EP_SIZE_INIT */
#define IFX_CIF_MIEP_CH_SIZE_INIT_EP_SIZE_INIT_LEN (22u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_SIZE_INIT_Bits.EP_SIZE_INIT */
#define IFX_CIF_MIEP_CH_SIZE_INIT_EP_SIZE_INIT_MSK (0x3fffffu)

/** \brief  Offset for Ifx_CIF_MIEP_CH_SIZE_INIT_Bits.EP_SIZE_INIT */
#define IFX_CIF_MIEP_CH_SIZE_INIT_EP_SIZE_INIT_OFF (2u)

/** \brief  Length for Ifx_CIF_MIEP_CH_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_SIZE_INIT_FIXED_TO_00_LEN (2u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_SIZE_INIT_FIXED_TO_00_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_MIEP_CH_SIZE_INIT_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_SIZE_INIT_FIXED_TO_00_OFF (0u)

/** \brief  Length for Ifx_CIF_MIEP_CH_SIZE_SHD_Bits.EP_SIZE */
#define IFX_CIF_MIEP_CH_SIZE_SHD_EP_SIZE_LEN (22u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_SIZE_SHD_Bits.EP_SIZE */
#define IFX_CIF_MIEP_CH_SIZE_SHD_EP_SIZE_MSK (0x3fffffu)

/** \brief  Offset for Ifx_CIF_MIEP_CH_SIZE_SHD_Bits.EP_SIZE */
#define IFX_CIF_MIEP_CH_SIZE_SHD_EP_SIZE_OFF (2u)

/** \brief  Length for Ifx_CIF_MIEP_CH_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_SIZE_SHD_FIXED_TO_00_LEN (2u)

/** \brief  Mask for Ifx_CIF_MIEP_CH_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_SIZE_SHD_FIXED_TO_00_MSK (0x3u)

/** \brief  Offset for Ifx_CIF_MIEP_CH_SIZE_SHD_Bits.FIXED_TO_00 */
#define IFX_CIF_MIEP_CH_SIZE_SHD_FIXED_TO_00_OFF (0u)

/** \brief  Length for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_1 */
#define IFX_CIF_MIEP_ICR_FILL_EP_1_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_1 */
#define IFX_CIF_MIEP_ICR_FILL_EP_1_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_1 */
#define IFX_CIF_MIEP_ICR_FILL_EP_1_OFF (1u)

/** \brief  Length for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_2 */
#define IFX_CIF_MIEP_ICR_FILL_EP_2_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_ICR_Bits.FILL_EP_2 */
#define IFX_CIF_MIEP_ICR_FILL_EP_2_MSK (0x1u)

