lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_bf.h
/** \brief  Length for Ifx_CIF_MIEP_RIS_Bits.FILL_EP_3 */
#define IFX_CIF_MIEP_RIS_FILL_EP_3_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_RIS_Bits.FILL_EP_3 */
#define IFX_CIF_MIEP_RIS_FILL_EP_3_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_RIS_Bits.FILL_EP_3 */
#define IFX_CIF_MIEP_RIS_FILL_EP_3_OFF (9u)

/** \brief  Length for Ifx_CIF_MIEP_RIS_Bits.FILL_EP_4 */
#define IFX_CIF_MIEP_RIS_FILL_EP_4_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_RIS_Bits.FILL_EP_4 */
#define IFX_CIF_MIEP_RIS_FILL_EP_4_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_RIS_Bits.FILL_EP_4 */
#define IFX_CIF_MIEP_RIS_FILL_EP_4_OFF (13u)

/** \brief  Length for Ifx_CIF_MIEP_RIS_Bits.FILL_EP_5 */
#define IFX_CIF_MIEP_RIS_FILL_EP_5_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_RIS_Bits.FILL_EP_5 */
#define IFX_CIF_MIEP_RIS_FILL_EP_5_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_RIS_Bits.FILL_EP_5 */
#define IFX_CIF_MIEP_RIS_FILL_EP_5_OFF (17u)

/** \brief  Length for Ifx_CIF_MIEP_RIS_Bits.FRAME_END_EP_1 */
#define IFX_CIF_MIEP_RIS_FRAME_END_EP_1_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_RIS_Bits.FRAME_END_EP_1 */
#define IFX_CIF_MIEP_RIS_FRAME_END_EP_1_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_RIS_Bits.FRAME_END_EP_1 */
#define IFX_CIF_MIEP_RIS_FRAME_END_EP_1_OFF (0u)

/** \brief  Length for Ifx_CIF_MIEP_RIS_Bits.FRAME_END_EP_2 */
#define IFX_CIF_MIEP_RIS_FRAME_END_EP_2_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_RIS_Bits.FRAME_END_EP_2 */
#define IFX_CIF_MIEP_RIS_FRAME_END_EP_2_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_RIS_Bits.FRAME_END_EP_2 */
#define IFX_CIF_MIEP_RIS_FRAME_END_EP_2_OFF (4u)

/** \brief  Length for Ifx_CIF_MIEP_RIS_Bits.FRAME_END_EP_3 */
#define IFX_CIF_MIEP_RIS_FRAME_END_EP_3_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_RIS_Bits.FRAME_END_EP_3 */
#define IFX_CIF_MIEP_RIS_FRAME_END_EP_3_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_RIS_Bits.FRAME_END_EP_3 */
#define IFX_CIF_MIEP_RIS_FRAME_END_EP_3_OFF (8u)

/** \brief  Length for Ifx_CIF_MIEP_RIS_Bits.FRAME_END_EP_4 */
#define IFX_CIF_MIEP_RIS_FRAME_END_EP_4_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_RIS_Bits.FRAME_END_EP_4 */
#define IFX_CIF_MIEP_RIS_FRAME_END_EP_4_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_RIS_Bits.FRAME_END_EP_4 */
#define IFX_CIF_MIEP_RIS_FRAME_END_EP_4_OFF (12u)

/** \brief  Length for Ifx_CIF_MIEP_RIS_Bits.FRAME_END_EP_5 */
#define IFX_CIF_MIEP_RIS_FRAME_END_EP_5_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_RIS_Bits.FRAME_END_EP_5 */
#define IFX_CIF_MIEP_RIS_FRAME_END_EP_5_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_RIS_Bits.FRAME_END_EP_5 */
#define IFX_CIF_MIEP_RIS_FRAME_END_EP_5_OFF (16u)

/** \brief  Length for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_1 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_1_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_1 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_1_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_1 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_1_OFF (3u)

/** \brief  Length for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_2 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_2_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_2 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_2_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_2 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_2_OFF (7u)

/** \brief  Length for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_3 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_3_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_3 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_3_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_3 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_3_OFF (11u)

/** \brief  Length for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_4 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_4_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_4 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_4_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_4 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_4_OFF (15u)

/** \brief  Length for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_5 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_5_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_5 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_5_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_RIS_Bits.MBLK_LINE_EP_5 */
#define IFX_CIF_MIEP_RIS_MBLK_LINE_EP_5_OFF (19u)

/** \brief  Length for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_1 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_1_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_1 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_1_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_1 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_1_OFF (2u)

/** \brief  Length for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_2 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_2_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_2 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_2_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_2 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_2_OFF (6u)

/** \brief  Length for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_3 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_3_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_3 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_3_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_3 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_3_OFF (10u)

/** \brief  Length for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_4 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_4_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_4 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_4_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_4 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_4_OFF (14u)

/** \brief  Length for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_5 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_5_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_5 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_5_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_RIS_Bits.WRAP_EP_5 */
#define IFX_CIF_MIEP_RIS_WRAP_EP_5_OFF (18u)

/** \brief  Length for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_1_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_1_IC_SIZE_ERR_CLR_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_1_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_1_IC_SIZE_ERR_CLR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_1_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_1_IC_SIZE_ERR_CLR_OFF (1u)

/** \brief  Length for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_2_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_2_IC_SIZE_ERR_CLR_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_2_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_2_IC_SIZE_ERR_CLR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_2_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_2_IC_SIZE_ERR_CLR_OFF (2u)

/** \brief  Length for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_3_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_3_IC_SIZE_ERR_CLR_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_3_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_3_IC_SIZE_ERR_CLR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_3_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_3_IC_SIZE_ERR_CLR_OFF (3u)

