lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_bf.h
/** \brief  Length for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_4_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_4_IC_SIZE_ERR_CLR_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_4_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_4_IC_SIZE_ERR_CLR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_4_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_4_IC_SIZE_ERR_CLR_OFF (4u)

/** \brief  Length for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_5_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_5_IC_SIZE_ERR_CLR_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_5_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_5_IC_SIZE_ERR_CLR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_STA_ERR_CLR_Bits.EP_5_IC_SIZE_ERR_CLR */
#define IFX_CIF_MIEP_STA_ERR_CLR_EP_5_IC_SIZE_ERR_CLR_OFF (5u)

/** \brief  Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_1_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_1_FIFO_FULL_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_1_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_1_FIFO_FULL_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_1_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_1_FIFO_FULL_OFF (17u)

/** \brief  Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_1_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_1_IC_SIZE_ERR_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_1_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_1_IC_SIZE_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_1_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_1_IC_SIZE_ERR_OFF (1u)

/** \brief  Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_2_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_2_FIFO_FULL_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_2_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_2_FIFO_FULL_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_2_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_2_FIFO_FULL_OFF (18u)

/** \brief  Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_2_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_2_IC_SIZE_ERR_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_2_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_2_IC_SIZE_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_2_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_2_IC_SIZE_ERR_OFF (2u)

/** \brief  Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_3_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_3_FIFO_FULL_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_3_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_3_FIFO_FULL_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_3_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_3_FIFO_FULL_OFF (19u)

/** \brief  Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_3_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_3_IC_SIZE_ERR_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_3_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_3_IC_SIZE_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_3_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_3_IC_SIZE_ERR_OFF (3u)

/** \brief  Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_4_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_4_FIFO_FULL_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_4_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_4_FIFO_FULL_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_4_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_4_FIFO_FULL_OFF (20u)

/** \brief  Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_4_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_4_IC_SIZE_ERR_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_4_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_4_IC_SIZE_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_4_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_4_IC_SIZE_ERR_OFF (4u)

/** \brief  Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_5_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_5_FIFO_FULL_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_5_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_5_FIFO_FULL_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_5_FIFO_FULL */
#define IFX_CIF_MIEP_STA_ERR_EP_5_FIFO_FULL_OFF (21u)

/** \brief  Length for Ifx_CIF_MIEP_STA_ERR_Bits.EP_5_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_5_IC_SIZE_ERR_LEN (1u)

/** \brief  Mask for Ifx_CIF_MIEP_STA_ERR_Bits.EP_5_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_5_IC_SIZE_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_MIEP_STA_ERR_Bits.EP_5_IC_SIZE_ERR */
#define IFX_CIF_MIEP_STA_ERR_EP_5_IC_SIZE_ERR_OFF (5u)

/** \brief  Length for Ifx_CIF_WD_CTRL_Bits.RST_H_CNT */
#define IFX_CIF_WD_CTRL_RST_H_CNT_LEN (1u)

/** \brief  Mask for Ifx_CIF_WD_CTRL_Bits.RST_H_CNT */
#define IFX_CIF_WD_CTRL_RST_H_CNT_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_WD_CTRL_Bits.RST_H_CNT */
#define IFX_CIF_WD_CTRL_RST_H_CNT_OFF (1u)

/** \brief  Length for Ifx_CIF_WD_CTRL_Bits.RST_PD_CNT */
#define IFX_CIF_WD_CTRL_RST_PD_CNT_LEN (1u)

/** \brief  Mask for Ifx_CIF_WD_CTRL_Bits.RST_PD_CNT */
#define IFX_CIF_WD_CTRL_RST_PD_CNT_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_WD_CTRL_Bits.RST_PD_CNT */
#define IFX_CIF_WD_CTRL_RST_PD_CNT_OFF (3u)

/** \brief  Length for Ifx_CIF_WD_CTRL_Bits.RST_V_CNT */
#define IFX_CIF_WD_CTRL_RST_V_CNT_LEN (1u)

/** \brief  Mask for Ifx_CIF_WD_CTRL_Bits.RST_V_CNT */
#define IFX_CIF_WD_CTRL_RST_V_CNT_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_WD_CTRL_Bits.RST_V_CNT */
#define IFX_CIF_WD_CTRL_RST_V_CNT_OFF (2u)

/** \brief  Length for Ifx_CIF_WD_CTRL_Bits.WD_EN */
#define IFX_CIF_WD_CTRL_WD_EN_LEN (1u)

/** \brief  Mask for Ifx_CIF_WD_CTRL_Bits.WD_EN */
#define IFX_CIF_WD_CTRL_WD_EN_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_WD_CTRL_Bits.WD_EN */
#define IFX_CIF_WD_CTRL_WD_EN_OFF (0u)

/** \brief  Length for Ifx_CIF_WD_CTRL_Bits.WD_PREDIV */
#define IFX_CIF_WD_CTRL_WD_PREDIV_LEN (16u)

/** \brief  Mask for Ifx_CIF_WD_CTRL_Bits.WD_PREDIV */
#define IFX_CIF_WD_CTRL_WD_PREDIV_MSK (0xffffu)

/** \brief  Offset for Ifx_CIF_WD_CTRL_Bits.WD_PREDIV */
#define IFX_CIF_WD_CTRL_WD_PREDIV_OFF (16u)

/** \brief  Length for Ifx_CIF_WD_H_TIMEOUT_Bits.WD_HES_TO */
#define IFX_CIF_WD_H_TIMEOUT_WD_HES_TO_LEN (16u)

/** \brief  Mask for Ifx_CIF_WD_H_TIMEOUT_Bits.WD_HES_TO */
#define IFX_CIF_WD_H_TIMEOUT_WD_HES_TO_MSK (0xffffu)

