lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_bf.h
/** \brief  Offset for Ifx_CIF_WD_H_TIMEOUT_Bits.WD_HES_TO */
#define IFX_CIF_WD_H_TIMEOUT_WD_HES_TO_OFF (16u)

/** \brief  Length for Ifx_CIF_WD_H_TIMEOUT_Bits.WD_HSE_TO */
#define IFX_CIF_WD_H_TIMEOUT_WD_HSE_TO_LEN (16u)

/** \brief  Mask for Ifx_CIF_WD_H_TIMEOUT_Bits.WD_HSE_TO */
#define IFX_CIF_WD_H_TIMEOUT_WD_HSE_TO_MSK (0xffffu)

/** \brief  Offset for Ifx_CIF_WD_H_TIMEOUT_Bits.WD_HSE_TO */
#define IFX_CIF_WD_H_TIMEOUT_WD_HSE_TO_OFF (0u)

/** \brief  Length for Ifx_CIF_WD_ICR_Bits.ICR_WD_HES_TO */
#define IFX_CIF_WD_ICR_ICR_WD_HES_TO_LEN (1u)

/** \brief  Mask for Ifx_CIF_WD_ICR_Bits.ICR_WD_HES_TO */
#define IFX_CIF_WD_ICR_ICR_WD_HES_TO_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_WD_ICR_Bits.ICR_WD_HES_TO */
#define IFX_CIF_WD_ICR_ICR_WD_HES_TO_OFF (1u)

/** \brief  Length for Ifx_CIF_WD_ICR_Bits.ICR_WD_HSE_TO */
#define IFX_CIF_WD_ICR_ICR_WD_HSE_TO_LEN (1u)

/** \brief  Mask for Ifx_CIF_WD_ICR_Bits.ICR_WD_HSE_TO */
#define IFX_CIF_WD_ICR_ICR_WD_HSE_TO_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_WD_ICR_Bits.ICR_WD_HSE_TO */
#define IFX_CIF_WD_ICR_ICR_WD_HSE_TO_OFF (0u)

/** \brief  Length for Ifx_CIF_WD_ICR_Bits.ICR_WD_VES_TO */
#define IFX_CIF_WD_ICR_ICR_WD_VES_TO_LEN (1u)

/** \brief  Mask for Ifx_CIF_WD_ICR_Bits.ICR_WD_VES_TO */
#define IFX_CIF_WD_ICR_ICR_WD_VES_TO_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_WD_ICR_Bits.ICR_WD_VES_TO */
#define IFX_CIF_WD_ICR_ICR_WD_VES_TO_OFF (3u)

/** \brief  Length for Ifx_CIF_WD_ICR_Bits.ICR_WD_VSE_TO */
#define IFX_CIF_WD_ICR_ICR_WD_VSE_TO_LEN (1u)

/** \brief  Mask for Ifx_CIF_WD_ICR_Bits.ICR_WD_VSE_TO */
#define IFX_CIF_WD_ICR_ICR_WD_VSE_TO_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_WD_ICR_Bits.ICR_WD_VSE_TO */
#define IFX_CIF_WD_ICR_ICR_WD_VSE_TO_OFF (2u)

/** \brief  Length for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_HES_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_HES_TO_LEN (1u)

/** \brief  Mask for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_HES_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_HES_TO_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_HES_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_HES_TO_OFF (1u)

/** \brief  Length for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_HSE_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_HSE_TO_LEN (1u)

/** \brief  Mask for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_HSE_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_HSE_TO_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_HSE_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_HSE_TO_OFF (0u)

/** \brief  Length for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_VES_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_VES_TO_LEN (1u)

/** \brief  Mask for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_VES_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_VES_TO_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_VES_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_VES_TO_OFF (3u)

/** \brief  Length for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_VSE_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_VSE_TO_LEN (1u)

/** \brief  Mask for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_VSE_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_VSE_TO_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_WD_IMSC_Bits.IMSC_WD_VSE_TO */
#define IFX_CIF_WD_IMSC_IMSC_WD_VSE_TO_OFF (2u)

/** \brief  Length for Ifx_CIF_WD_ISR_Bits.ISR_WD_HES_TO */
#define IFX_CIF_WD_ISR_ISR_WD_HES_TO_LEN (1u)

/** \brief  Mask for Ifx_CIF_WD_ISR_Bits.ISR_WD_HES_TO */
#define IFX_CIF_WD_ISR_ISR_WD_HES_TO_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_WD_ISR_Bits.ISR_WD_HES_TO */
#define IFX_CIF_WD_ISR_ISR_WD_HES_TO_OFF (1u)

/** \brief  Length for Ifx_CIF_WD_ISR_Bits.ISR_WD_HSE_TO */
#define IFX_CIF_WD_ISR_ISR_WD_HSE_TO_LEN (1u)

/** \brief  Mask for Ifx_CIF_WD_ISR_Bits.ISR_WD_HSE_TO */
#define IFX_CIF_WD_ISR_ISR_WD_HSE_TO_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_WD_ISR_Bits.ISR_WD_HSE_TO */
#define IFX_CIF_WD_ISR_ISR_WD_HSE_TO_OFF (0u)

/** \brief  Length for Ifx_CIF_WD_ISR_Bits.ISR_WD_VES_TO */
#define IFX_CIF_WD_ISR_ISR_WD_VES_TO_LEN (1u)

/** \brief  Mask for Ifx_CIF_WD_ISR_Bits.ISR_WD_VES_TO */
#define IFX_CIF_WD_ISR_ISR_WD_VES_TO_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_WD_ISR_Bits.ISR_WD_VES_TO */
#define IFX_CIF_WD_ISR_ISR_WD_VES_TO_OFF (3u)

/** \brief  Length for Ifx_CIF_WD_ISR_Bits.ISR_WD_VSE_TO */
#define IFX_CIF_WD_ISR_ISR_WD_VSE_TO_LEN (1u)

/** \brief  Mask for Ifx_CIF_WD_ISR_Bits.ISR_WD_VSE_TO */
#define IFX_CIF_WD_ISR_ISR_WD_VSE_TO_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_WD_ISR_Bits.ISR_WD_VSE_TO */
#define IFX_CIF_WD_ISR_ISR_WD_VSE_TO_OFF (2u)

/** \brief  Length for Ifx_CIF_WD_MIS_Bits.MIS_WD_HES_TO */
#define IFX_CIF_WD_MIS_MIS_WD_HES_TO_LEN (1u)

/** \brief  Mask for Ifx_CIF_WD_MIS_Bits.MIS_WD_HES_TO */
#define IFX_CIF_WD_MIS_MIS_WD_HES_TO_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_WD_MIS_Bits.MIS_WD_HES_TO */
#define IFX_CIF_WD_MIS_MIS_WD_HES_TO_OFF (1u)

/** \brief  Length for Ifx_CIF_WD_MIS_Bits.MIS_WD_HSE_TO */
#define IFX_CIF_WD_MIS_MIS_WD_HSE_TO_LEN (1u)

/** \brief  Mask for Ifx_CIF_WD_MIS_Bits.MIS_WD_HSE_TO */
#define IFX_CIF_WD_MIS_MIS_WD_HSE_TO_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_WD_MIS_Bits.MIS_WD_HSE_TO */
#define IFX_CIF_WD_MIS_MIS_WD_HSE_TO_OFF (0u)

/** \brief  Length for Ifx_CIF_WD_MIS_Bits.MIS_WD_VES_TO */
#define IFX_CIF_WD_MIS_MIS_WD_VES_TO_LEN (1u)

/** \brief  Mask for Ifx_CIF_WD_MIS_Bits.MIS_WD_VES_TO */
#define IFX_CIF_WD_MIS_MIS_WD_VES_TO_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_WD_MIS_Bits.MIS_WD_VES_TO */
#define IFX_CIF_WD_MIS_MIS_WD_VES_TO_OFF (3u)

/** \brief  Length for Ifx_CIF_WD_MIS_Bits.MIS_WD_VSE_TO */
#define IFX_CIF_WD_MIS_MIS_WD_VSE_TO_LEN (1u)

/** \brief  Mask for Ifx_CIF_WD_MIS_Bits.MIS_WD_VSE_TO */
#define IFX_CIF_WD_MIS_MIS_WD_VSE_TO_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_WD_MIS_Bits.MIS_WD_VSE_TO */
#define IFX_CIF_WD_MIS_MIS_WD_VSE_TO_OFF (2u)

/** \brief  Length for Ifx_CIF_WD_RIS_Bits.RIS_WD_HES_TO */
#define IFX_CIF_WD_RIS_RIS_WD_HES_TO_LEN (1u)

/** \brief  Mask for Ifx_CIF_WD_RIS_Bits.RIS_WD_HES_TO */
#define IFX_CIF_WD_RIS_RIS_WD_HES_TO_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_WD_RIS_Bits.RIS_WD_HES_TO */
#define IFX_CIF_WD_RIS_RIS_WD_HES_TO_OFF (1u)

/** \brief  Length for Ifx_CIF_WD_RIS_Bits.RIS_WD_HSE_TO */
#define IFX_CIF_WD_RIS_RIS_WD_HSE_TO_LEN (1u)

