lkeonwoo94/Embedded/한컴MDS_자율주행SW과정/DEVICECONTROL_MCAL/BSW/mcal_base/general/tricore/inc/TC27xC/IfxCif_bf.h
/** \brief  Mask for Ifx_CIF_WD_RIS_Bits.RIS_WD_HSE_TO */
#define IFX_CIF_WD_RIS_RIS_WD_HSE_TO_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_WD_RIS_Bits.RIS_WD_HSE_TO */
#define IFX_CIF_WD_RIS_RIS_WD_HSE_TO_OFF (0u)

/** \brief  Length for Ifx_CIF_WD_RIS_Bits.RIS_WD_VES_TO */
#define IFX_CIF_WD_RIS_RIS_WD_VES_TO_LEN (1u)

/** \brief  Mask for Ifx_CIF_WD_RIS_Bits.RIS_WD_VES_TO */
#define IFX_CIF_WD_RIS_RIS_WD_VES_TO_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_WD_RIS_Bits.RIS_WD_VES_TO */
#define IFX_CIF_WD_RIS_RIS_WD_VES_TO_OFF (3u)

/** \brief  Length for Ifx_CIF_WD_RIS_Bits.RIS_WD_VSE_TO */
#define IFX_CIF_WD_RIS_RIS_WD_VSE_TO_LEN (1u)

/** \brief  Mask for Ifx_CIF_WD_RIS_Bits.RIS_WD_VSE_TO */
#define IFX_CIF_WD_RIS_RIS_WD_VSE_TO_MSK (0x1u)

/** \brief  Offset for Ifx_CIF_WD_RIS_Bits.RIS_WD_VSE_TO */
#define IFX_CIF_WD_RIS_RIS_WD_VSE_TO_OFF (2u)

/** \brief  Length for Ifx_CIF_WD_V_TIMEOUT_Bits.WD_VES_TO */
#define IFX_CIF_WD_V_TIMEOUT_WD_VES_TO_LEN (16u)

/** \brief  Mask for Ifx_CIF_WD_V_TIMEOUT_Bits.WD_VES_TO */
#define IFX_CIF_WD_V_TIMEOUT_WD_VES_TO_MSK (0xffffu)

/** \brief  Offset for Ifx_CIF_WD_V_TIMEOUT_Bits.WD_VES_TO */
#define IFX_CIF_WD_V_TIMEOUT_WD_VES_TO_OFF (16u)

/** \brief  Length for Ifx_CIF_WD_V_TIMEOUT_Bits.WD_VSE_TO */
#define IFX_CIF_WD_V_TIMEOUT_WD_VSE_TO_LEN (16u)

/** \brief  Mask for Ifx_CIF_WD_V_TIMEOUT_Bits.WD_VSE_TO */
#define IFX_CIF_WD_V_TIMEOUT_WD_VSE_TO_MSK (0xffffu)

/** \brief  Offset for Ifx_CIF_WD_V_TIMEOUT_Bits.WD_VSE_TO */
#define IFX_CIF_WD_V_TIMEOUT_WD_VSE_TO_OFF (0u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCIF_BF_H */
